{
"Courses" : [
			{"CSC 400":{"CourseName":"Discrete Structures for Computer Science","Prereq":"","Description":"This course covers the basic mathematical tools essential for solving problems in computer science. The mathematical topics are presented with emphasis on their applications in computer science. The topics covered include: logic and set theory, relations, functions, graphs, and counting and probability.","Years":["Fall 2018-2019","Spring 2017-2018","Winter 2017-2018","Fall 2017-2018","Summer I 2016-2017","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","Summer I 2015-2016","Spring 2015-2016","Winter 2015-2016","Fall 2015-2016","Summer I 2014-2015","Spring 2014-2015","Winter 2014-2015","Fall 2014-2015","Summer I 2013-2014","Spring 2013-2014","Winter 2013-2014","Fall 2013-2014","Summer I 2012-2013","Spring 2012-2013"]},"CSC 401":{"CourseName":"Introduction to Programming","Prereq":"PREREQUISITE(S): None","Description":"An introduction to programming with a focus on problem solving, structured programming, and algorithm design with a gentle introduction to efficiency. Concepts covered include data types, expressions, variables, assignments, conditional and iterative structures, functions, file input/output, exceptions, namespaces, and recursion.","Years":["Fall 2018-2019","Summer II 2017-2018","Spring 2017-2018","Winter 2017-2018","Fall 2017-2018","Summer II 2016-2017","Summer I 2016-2017","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","Summer II 2015-2016","Spring 2015-2016","Winter 2015-2016","Fall 2015-2016","Summer II 2014-2015","Spring 2014-2015","Fall 2014-2015","Summer II 2013-2014","Spring 2013-2014","Winter 2013-2014","Fall 2013-2014","Spring 2012-2013"]},"CSC 402":{"CourseName":"Data Structures I","Prereq":"PREREQUISITE(S): CSC 401","Description":"A first course on data structures in Java for graduate students. The course introduces Java programming from within the context of data structures. The course covers arrays, linked lists, stacks and queues, data structures supporting disjoint-set operations, and discusses recursion and performance analysis. The implementation of the basic operations on each data structure are discussed and analyzed in terms of their efficiency.","Years":["Fall 2018-2019","Winter 2017-2018","Fall 2017-2018","Summer I 2016-2017","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","Summer I 2015-2016","Spring 2015-2016","Winter 2015-2016","Fall 2015-2016","Summer I 2014-2015","Spring 2014-2015","Winter 2014-2015","Fall 2014-2015","Summer I 2013-2014","Spring 2013-2014","Winter 2013-2014","Fall 2013-2014","Summer I 2012-2013","Spring 2012-2013"]},"CSC 406":{"CourseName":"Systems I","Prereq":"PREREQUISITE(S): CSC 401","Description":"An introductory graduate course on computer systems topics, focusing on machine-level programming and architecture and their relevance for application programming. Information representations, assembly language and debuggers, processor architecture, program optimization, memory hierarchy and caching. Students are recommended to finish CSC 400 before enrolling in this course.","Years":["Fall 2018-2019","Spring 2017-2018","Winter 2017-2018","Fall 2017-2018","Summer I 2016-2017","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","Summer I 2015-2016","Spring 2015-2016","Winter 2015-2016","Summer I 2014-2015","Spring 2014-2015","Winter 2014-2015","Fall 2014-2015","Summer I 2013-2014","Spring 2013-2014","Winter 2013-2014","Fall 2013-2014","Summer I 2012-2013","Spring 2012-2013"]},"CSC 407":{"CourseName":"Systems II","Prereq":"PREREQUISITE(S): CSC 406 and CSC 402","Description":"An introductory graduate course on computer systems topics, focusing on operating systems components and their relevance for application programming. Linking, processes, virtual memory, dynamic memory allocation, system level I/O, networking and network programming, concurrent servers and web services.","Years":["Fall 2018-2019","Spring 2017-2018","Winter 2017-2018","Fall 2017-2018","Summer II 2016-2017","Spring 2016-2017","Winter 2016-2017","CLOSED Fall 2016-2017","Summer II 2015-2016","Spring 2015-2016","Fall 2015-2016","Summer II 2014-2015","Spring 2014-2015","Winter 2014-2015","Fall 2014-2015","Summer II 2013-2014","Spring 2013-2014","Winter 2013-2014","Fall 2013-2014","Summer II 2012-2013","Spring 2012-2013"]},"CSC 421":{"CourseName":"Applied Algorithms and Structures","Prereq":"PREREQUISITE(S): CSC 400 and CSC 403","Description":"This course covers techniques for designing and analyzing algorithms and structures in the context of computer application development. Examples will come from Internet, WWW, database, and computer system applications. Fundamental topics such as running-time analysis, searching and sorting within various structures, divide-and-conquer and dynamic programming will be covered.","Years":["Fall 2018-2019","CLOSED Winter 2017-2018","CLOSED Fall 2017-2018","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","Spring 2015-2016","Winter 2015-2016","Fall 2015-2016","Spring 2014-2015","Winter 2014-2015","Fall 2014-2015","Spring 2013-2014","Winter 2013-2014","Fall 2013-2014","Spring 2012-2013"]},"CSC 435":{"CourseName":"Distributed Systems I","Prereq":"PREREQUISITE(S): CSC 403 and CSC 407","Description":"An introduction to distributed systems. Topics may include: architecture of distributed systems","Years":[null]},"CSC 447":{"CourseName":"Concepts of Programming Languages","Prereq":"PREREQUISITE(S): CSC 403 and CSC 406","Description":"Programming paradigms and language concepts: functional programming","Years":[null]},"CSC 453":{"CourseName":"Database Technologies","Prereq":"PREREQUISITE(S): CSC 403","Description":"A core graduate course in database design and implementation. Topics include database implementation and queries in SQL, logical design or relational databases, storage and indexes, database programming, and emerging database models.","Years":["Fall 2018-2019","Winter 2017-2018","Fall 2017-2018","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","CLOSED Spring 2015-2016","Winter 2015-2016","Fall 2015-2016","Spring 2013-2014","Winter 2013-2014","Fall 2013-2014"]},"SE 450":{"CourseName":"Object-Oriented Software Development","Prereq":"PREREQUISITE(S): CSC 403","Description":"Principle techniques and tools of object-oriented modeling design implementation, and testing of large-scale software systems. Topics include design patterns, application frameworks, architectural design, and the applications in the software development process to improve the extensibility, maintainability, and reliability of software systems.","Years":["Fall 2018-2019","Winter 2017-2018","Fall 2017-2018","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017"]}},
			{"CSC 457":{"CourseName":"Expert Systems","Prereq":"PREREQUISITE(S): CSC 403","Description":"A study of the development of expert systems. Students will use commercial packages to develop standalone and embedded expert systems. Topics will include rule-based systems, decision trees, forward and backward chaining, inference, reasoning with uncertainty, and intelligent agents.","Years":[]},"CSC 458":{"CourseName":"Symbolic Programming","Prereq":"PREREQUISITE(S): CSC 403","Description":"Concepts of symbolic programming as embodied in the language LISP. Basic data and control structures of LISP: symbolic expressions, the interpreter, functions, recursion, iteration. Techniques for prototyping and building conceptually advanced systems in an environment that encourages procedural and data abstraction. Advanced topics may include Prolog, intelligent tutoring systems, intelligent agents, and natural language processing. Assignments will focus on basic AI techniques, but the class is intended for anyone who will need to rapidly develop large complex systems.","Years":["Winter 2017-2018","Winter 2015-2016","Winter 2013-2014"]},"CSC 480":{"CourseName":"Artificial Intelligence I","Prereq":"PREREQUISITE(S): CSC 403","Description":"An in-depth survey of important concepts, problems, and techniques in artificial intelligence, including search, knowledge representation, logical reasoning, and reasoning with uncertainty. A particular focus and a unifying theme of the course will be the concept of intelligent agents. No prior knowledge of AI is required. The course is particularly suitable for graduate and advanced undergraduate students who want to gain the technical background necessary to build intelligent systems, or who want to prepare for more advanced work in AI. The concepts and techniques learned in this course will be directly applicable to many other areas of computer science including software design, distributed systems, databases, and information management and retrieval.","Years":["Spring 2017-2018","Winter 2017-2018","Winter 2016-2017","Winter 2015-2016","Winter 2014-2015","Winter 2013-2014"]},"CSC 481":{"CourseName":"Introduction to Image Processing","Prereq":"PREREQUISITE(S): CSC 412 or consent of instructor","Description":"The course is a prerequisite for more advanced Visual Computing (VC) courses and the students will be challenged to implement VC algorithms for real world applications. The topics covered in the course include: components of an image processing system and its applications, elements of visual perception, sampling and quantization, image enhancement by histogram equalization, color spaces and transformations, introduction to segmentation (Edge detection), and morphological image processing.","Years":["Fall 2018-2019","Fall 2016-2017","Fall 2015-2016","Fall 2014-2015","Fall 2013-2014"]},"CSC 482":{"CourseName":"Applied Image Analysis","Prereq":"PREREQUISITE(S) CSC 481","Description":"Fundamentals of computational image analysis will be explored in terms of its two most important components, image information extraction and modeling of image patterns. These components will be studied in the context of image representation, segmentation, classification, retrieval and recognition. The course will be useful for students interested in image analysis related to areas such as image databases, multimedia management, animation, GIS, computer graphics, medical imaging, remote sensing and robotics. Specific topics include, but are not limited to segmentation, multi-scale representation, shape analysis, texture analysis, Fourier analysis, wavelets, Gabor and fractal analysis, template matching, and object recognition.","Years":["Winter 2017-2018","Winter 2016-2017","Winter 2014-2015","Winter 2013-2014"]},"CSC 528":{"CourseName":"Computer Vision","Prereq":"PREREQUISITE(S): CSC 481","Description":"Computer Vision techniques for analysis of patterns in visual images and videos of 2D and 3D scenes will be explored with the goal of interpreting, understanding, and reconstructing 3D scenes. Topics to be covered include image formation and representation, 2D and 3D feature extraction, camera calibration, reconstruction of depth based on stereo, shading, focus, texture, and geometry, object detection and tracking, motion analysis, analytical performance characterization, and 3D recognition of objects and scenes using statistical and model-based techniques. The course will be useful for students interested in computer vision related areas such as robotics, remote sensing, and medical imaging. A significant part of the course will be dedicated to the discussion of articles recently published in the literature.","Years":["Spring 2017-2018","Spring 2016-2017","Spring 2013-2014"]},"CSC 538":{"CourseName":"Vision Systems","Prereq":"PREREQUISITE(S): CSC 528","Description":"Vision Systems will cover the geometry of computer vision as well as a survey of working vision systems to include 1) Content-based Image Retrieval Systems","Years":[null]},"CSC 575":{"CourseName":"Intelligent Information Retrieval","Prereq":"PREREQUISITE(S): CSC 403","Description":"Examination of the design, implementation, and evaluation of information retrieval systems. The focus is on the underlying retrieval models, algorithms, and system implementations. Also examined is how an effective information search and retrieval is interrelated with the organization and description of information to be retrieved. Topics include: automatic indexing","Years":[null]},"CSC 576":{"CourseName":"Computational Advertising","Prereq":"Prerequisite(s): IS 467 or CSC 478 or ECT 584","Description":"Computational advertising is the problem of finding the best advertisement for a given user in a given on-line context. It is a complex and emerging area at the intersection of quantitative marketing, web search, data mining, recommendation, optimization, and algorithmic game theory. Students will read current scientific papers and explore a range of models both mathematically and empirically. Students can choose from three types of final course projects: implementation projects, research papers, or data analysis projects.","Years":["Winter 2017-2018","Winter 2015-2016"]},"CSC 577":{"CourseName":"Recommender Systems","Prereq":"PREREQUISITE(S): (CSC 412 and CSC 478) or (CSC 403 and IS 467)","Description":"Recommender systems offer personalized access to online information in product catalogs, social media networks, and document collections, among other applications. This class will introduce students to a range of approaches for building recommender systems including collaborative, content-based, knowledge-based, and hybrid methods. Students will implement recommendation algorithms using an open-sourced toolkit and conduct experimental evaluations.","Years":["Spring 2017-2018","Winter 2016-2017"]},"CSC 578":{"CourseName":"Neural Networks and Deep Learning","Prereq":"PREREQUISITE(S): (CSC 412 and DSC 478) or (CSC 403 and DSC 441)","Description":"Course focuses on the algorithms, implement, and application of neural networks for learning about data. It will present how neural networks represent data and learn in supervised and unsupervised contexts with applications to language processing, classification, and regression problems. Topics include learning algorithms, and optimization methods, deep learning methods for deriving deep representations from surface features, recursive networks, Boltzmann machines and convolutional networks.","Years":["Fall 2018-2019","Fall 2016-2017","Fall 2015-2016","Fall 2014-2015","Fall 2013-2014"]},"CSC 583":{"CourseName":"Artificial Intelligence II","Prereq":"PREREQUISITE(S): CSC 480","Description":"The course provides an in-depth coverage of advanced topics in Artificial Intelligence, including planning, reasoning with uncertainty, decision theoretic agents, constraint satisfaction and optimization problems, as well as selected topics of interest in knowledge representation, machine learning, and natural language processing. These topics are discussed in the context of design and implementation of real-world intelligent agents. This course is suitable for advanced students with interest in further study in artificial intelligence and related topics, as well as those interested in the application of AI techniques in building systems with intelligent components.","Years":[]},"CSC 587":{"CourseName":"Cognitive Science","Prereq":"PREREQUISITE(S): CSC 403 or HCI 460.","Description":"A study of the relationships between our knowledge of human and computer intelligence. Levels of analysis of intelligent system, examples of cognitive models, and exposure to current publications, with an emphasis on those related to human computer interaction. Students will participate in the design and testing of models of human intelligence, both experimentally and using computer models.","Years":["Winter 2017-2018","Winter 2016-2017","Winter 2015-2016","Winter 2014-2015","Winter 2013-2014"]},"CSC 592":{"CourseName":"Topics in Computer Vision and Pattern Recognition","Prereq":"PREREQUISITE(S): CSC 482 or CSC 528","Description":"This is an independent study course. May be repeated for credit.","Years":[]},"CSC 594":{"CourseName":"Topics in Artificial Intelligence","Prereq":"PREREQUISITE(S): For specific prerequisites, see syllabus or consult course instructor. (variable credit)","Description":"Specific topics will be selected by the instructor and may vary with each quarter. Can be repeated for credit. Variable credit.","Years":[null,null,"Spring 2015-2016",null,null]},"GEO 441":{"CourseName":"Geographic Information Systems (Gis) for Community Development","Prereq":"PREREQUISITE(S): NONE","Description":"This course will focus on applications of Geographic Information Systems (GIS) to community studies and community development. As an amalgam of information technologies (e.g. database management, Web 2.0) and earth measurement technologies (e.g. global positioning systems, remote sensing), GIS is rapidly entering the realm of community development. The course will explain how GIS works","Years":[null]},"GEO 442":{"CourseName":"Geographical Information Systems (Gis) for Sustainable Urban Development","Prereq":"PREREQUISITE(S): GEO 441","Description":"This course will examine how GIS has been used to monitor, and evaluate efforts advancing sustainability in urban areas. Students will learn geospatial techniques in support of sustainable practices, including promoting energy efficiency, managing water resources, promoting sustainable options of transportation, improving access to local healthy foods, and responding to climate change. This is accomplished through hands-on lab activities and a case study conducted in collaboration with a non-profit organization engaged in promotion of sustainable practices in Chicago. GEO 441 (or instructor permission) is a prerequisite for this course.","Years":[null,null,null]}},
			{"CSC 451":{"CourseName":"Database Design for Information Systems","Prereq":"PREREQUISITE(S): None","Description":"Requirement analysis, conceptual design, logical design and implementation of relational databases. Emphasis will be on E-R modeling and E-R mapping, along with basic normalization and SQL for database implementation.","Years":["Fall 2018-2019","Spring 2017-2018","Winter 2017-2018","Fall 2017-2018","Summer I 2016-2017","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","Summer I 2015-2016","Spring 2015-2016","Winter 2015-2016","Fall 2015-2016","Summer I 2014-2015","Spring 2014-2015","Winter 2014-2015","Fall 2014-2015","Summer I 2013-2014","Spring 2013-2014","Winter 2013-2014","Fall 2013-2014","Summer I 2012-2013","Spring 2012-2013"]},"CNS 440":{"CourseName":"Information Security Management","Prereq":"PREREQUISITE(S): None","Description":"Survey of information security management as it applies to information systems analysis, design, and operations. Managing information assets and the security infrastructure. Emphasis on managing security-related risk, as well as the process of developing, implementing, and maintaining organizational policies, standards, procedures, and guidelines. Identifying and evaluating information assets, threats, and vulnerabilities. Quantitative and qualitative risk analysis, risk mitigation, residual risk, and risk treatment as they relate to information security. Topics include information security vulnerabilities, threats, and risk management","Years":[null]},"ECT 424":{"CourseName":"Enterprise Infrastructure","Prereq":"","Description":"Introduction to modern infrastructure and the evolving technology environment. Major topics include: computer networks, Internet infrastructure, Web 2.0, Enterprise 2.0, social media and networking, software as a service, content management systems, cloud computing, and portal.","Years":["Fall 2018-2019","Spring 2017-2018","Winter 2017-2018","Fall 2017-2018","Summer I 2016-2017","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","Summer I 2015-2016","Spring 2015-2016","Winter 2015-2016","Fall 2015-2016","Summer I 2014-2015","Spring 2014-2015","Winter 2014-2015","Fall 2014-2015","Summer I 2013-2014"]},"ECT 480":{"CourseName":"Intranets and Portals","Prereq":"PREREQUISITE(S): ECT 424","Description":"Intranet development methodology. Data warehousing concept and On-Line analytic processing (OLAP) for information management. Enterprise information portals (EIP). Transforming information into knowledge. Major applications involve: decision support, customer applications and content personalization for intranet. Students will conduct case studies and projects.","Years":["Spring 2015-2016"]},"HCI 440":{"CourseName":"Introduction to User-Centered Design","Prereq":"PREREQUISITE(S): None","Description":"The user-interface development process. Introduction to methods for practicing user-centered design including user and task analysis, user interface design principles and testing using low-fidelity prototypes. Students may not receive credit for this course and HCI 441.","Years":["Fall 2018-2019","Spring 2017-2018","CLOSED Winter 2017-2018","Fall 2017-2018","Summer 10 week 2016-2017","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","CLOSED Summer 10 week 2015-2016","CLOSED Spring 2015-2016","Spring 2014-2015","Fall 2014-2015","Summer 10 week 2013-2014","Winter 2013-2014","Fall 2013-2014","Spring 2012-2013"]},"IS 421":{"CourseName":"Systems Analysis","Prereq":"PREREQUISITE(S): None","Description":"Course focus is on both traditional and object oriented systems analysis, with an emphasis upon developing competency in a wide range of modeling techniques. Specific topics include: overview of the software development environment and project management","Years":[null]},"IS 422":{"CourseName":"System Design, Implementation, and Maintenance","Prereq":"PREREQUISITE(S): IS 421 and CSC 451","Description":"Course focus is on both traditional and object oriented systems design. Specific topics include: database design, including logical and physical design","Years":[null]},"IS 430":{"CourseName":"Fundamentals of IT Project Management","Prereq":"PREREQUISITE(S): None","Description":"This course concentrates on monitoring, managing and controlling assets and resources on a single IT project. Topics covered are project methodologies","Years":[null]},"IS 431":{"CourseName":"Digital Product Management","Prereq":"PREREQUISITE(S): None","Description":"This course focuses on the central role of the Product Manager in creating and sustaining compelling products and services throughout the product lifecycle. Special emphasis is placed on the creation and management of intangible technology products and services throughout the entire product management lifecycle. Product managers act as the focal point for value creation within their organizations leading cross functional product activities from the conception of an idea to the ultimate product retirement.","Years":["Winter 2017-2018","Winter 2015-2016"]},"IS 435":{"CourseName":"Organizational Modeling","Prereq":"PREREQUISITE(S): IS 421 or SE 430","Description":"The course explores contemporary approaches to analyzing and modeling organizational problems, processes, workflow, users and data. The emphasis is on the initial stages of analysis where the root cause of problems are identified, formulated and modeled. Students will acquire an array of modeling skills and be able to prescribe the proper modeling approach based on a variety of organizational and contextual factors. Business process modeling, management and metrics will be covered. Object-oriented and user-centered approaches will be introduced.","Years":["Fall 2018-2019","Fall 2017-2018","Spring 2016-2017","Fall 2016-2017","Fall 2015-2016","Fall 2014-2015"]},"IS 440":{"CourseName":"Collaborative Technologies for Leading Projects","Prereq":"PREREQUISITE(S): None","Description":"Study of the process of virtual teaming with emphasis on facilitation of different time project activities and facilitation of same time meetings. Students will learn how small group psychology and group communication theories inform specific behaviors in the design and leadership of meetings. Several meeting types including information briefing, focus group, document writing, decision making, requirements gathering, and teaching/training will be explored. In addition, the course surveys current collaboration technologies and discusses how to select among those technologies usability and fit to purpose of a meeting agenda. DL students may be required to schedule same time sessions with the instructor and other DL students","Years":[null]},"IS 444":{"CourseName":"IT Auditing","Prereq":"PREREQUISITE(S): None","Description":"Management and boards continue to recognize the importance of effectively managing information technology (IT) assets - to meet business objectives and to thoughtfully manage IT related business risks. This course examines the key principles related to auditing information technology processes and related controls and is designed to meet the ever increasing needs of IT audit and IT governance professionals. In addition, this course aids in the preparation for the Certified Information Systems Auditor (CISA) exam.","Years":["Fall 2018-2019","Fall 2017-2018","Spring 2016-2017","Fall 2016-2017","Spring 2015-2016","Fall 2015-2016","Spring 2014-2015","Fall 2014-2015","Spring 2013-2014","Fall 2013-2014","Spring 2012-2013"]},"IS 455":{"CourseName":"Electronic Business","Prereq":"PREREQUISITE(S): None. For Kellstadt students or students pursuing the MS in Business Information Technology only.","Description":"An introduction to electronic business. The topics include business models, technologies, business and social impact of e-business. It explores the tools, skills, business and social implications of emerging electronic business. In addition to acquiring basic skills for identifying electronic business opportunities and creating a presence in the online marketplace, the student reexamines fundamental processes of business as they are performed in cyberspace in contrast to the marketplace. This helps them understand changes as the cyberspace grows increasingly important in the global economy.","Years":["Spring 2017-2018","Spring 2016-2017","Spring 2015-2016","Spring 2014-2015","Fall 2014-2015","Fall 2013-2014","Spring 2012-2013"]},"IS 483":{"CourseName":"Information Services and Operations","Prereq":"PREREQUISITE(S): Completion of five or more SoC MS level courses is required.","Description":"This course focuses on the operational aspects of information systems in organizations by examining the concepts, tools and techniques available to IS professionals responsible for the delivery of IT services. Topics include the organization of the IT services","Years":[null]},"IS 485":{"CourseName":"Requirements Elicitation, Analysis, and Specification","Prereq":"PREREQUISITE(S): IS 422 or IS 430 or PM 430.","Description":"This course focuses on the concepts and skills needed to elicit, analyze, specify, and manage requirements for a software or systems level project. Students will learn to identify and work with stakeholders through conducting a variety of requirements gathering techniques including interviewing, surveying, ethnography, and Joint Application Design (JAD) sessions, to identify and analyze requirements conflicts and negotiate solutions, to model requirements and specify them in unambiguous ways, and to manage requirements throughout the software lifecycle using change controls, traceability, and impact analysis techniques. The requirements process will be examined in both traditional and agile environments. Current topics such as requirements for product lines or distributed development teams will also be explored as time permits. A student may not take both SE 482 and IS 485 for credit toward a degree.","Years":["Winter 2017-2018","Winter 2016-2017","Winter 2015-2016","Winter 2014-2015","Winter 2013-2014"]},"IS 535":{"CourseName":"Information Technology Investment Financial Analysis","Prereq":"PREREQUISITE(S): SE 477 or IS 565 or ACCT 500 or IS 430 or PM 430 or ECT 455","Description":"This course focuses on the application of financial analysis and decision-making approaches to aid information technology investment decisions at the operational, project, tactical and strategic levels. Students will learn how to apply a variety of financial methods -- breakeven analysis, present value analysis, profitability index, and return on investment to various IT investment decisions. The course will also address cost benefit analysis, outsourcing, balanced scorecard, and multi-factor scoring, benchmarking, and IT investment portfolio methods. These techniques will prepare students to manage capital budgets, acquisition of system and application software, hardware, personnel, and professional services at project and system levels as well as enterprise investment portfolio.","Years":["Fall 2018-2019","Fall 2017-2018","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","Spring 2015-2016","Winter 2015-2016","Fall 2015-2016","Spring 2014-2015","Winter 2014-2015","Fall 2014-2015","Spring 2013-2014","Winter 2013-2014","Fall 2013-2014","Spring 2012-2013"]},"IS 540":{"CourseName":"Global Information Technology","Prereq":"PREREQUISITE(S): Completion of five or more SoC MS level courses is required.","Description":"A study of the hardware, software, and techniques for using virtual information technologies to support teams working in a distributed, virtual, or global environments. Topics include software survey and evaluation, software deployment within organizational and trans-organizational contexts, trans-national vendor relationships, trans-border data flow, geographically dispersed software development, and integration of diverse technologies.","Years":["Winter 2016-2017","Winter 2015-2016","Winter 2014-2015","Winter 2013-2014"]},"IS 556":{"CourseName":"Enterprise Project Management","Prereq":"PREREQUISITE(S): IS 430 or PM 430","Description":"This course covers how an enterprise coordinates and effectively manages all its IT projects and programs through program management and the IT program management office. Students will learn the role of the IT program management office in establishing and maintaining the project and program infrastructure and in assisting project managers, program managers, and the executive steering committee. Students will analyze the role of program management in coordinating the delivery of expected program benefits, in managing stakeholder expectations, and in establishing program governance.","Years":["Summer II 2017-2018","Winter 2017-2018","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","Spring 2015-2016","Winter 2015-2016","Fall 2015-2016","Spring 2014-2015","Winter 2014-2015","Fall 2014-2015","Spring 2013-2014","Winter 2013-2014","Fall 2013-2014","Spring 2012-2013"]},"IS 560":{"CourseName":"Enterprise Systems","Prereq":"PREREQUISITE(S): Advanced Standing","Description":"An introduction to enterprise systems for data and process integration, including ERP systems. Topics include the requirements of enterprise systems, application architecture, tools, and functionality of leading enterprise systems, life cycle and methodologies for systems integration, selection, and implementation strategies. Also addressed are emerging trends for enterprise systems and relationship among component systems.","Years":["Fall 2018-2019","CLOSED Fall 2017-2018","Spring 2016-2017","Fall 2016-2017","Spring 2015-2016","Fall 2015-2016","Spring 2014-2015","CLOSED Fall 2014-2015","CLOSED Spring 2013-2014","CLOSED Fall 2013-2014","Spring 2012-2013"]},"IS 565":{"CourseName":"IT Outsourcing","Prereq":"PREREQUISITE(S): Completion of five or more SoC MS level courses is required","Description":"The course focuses on how organizations can use leverage of scale as a source for cost reduction","Years":[null]},"IS 578":{"CourseName":"Information Technology Consulting","Prereq":"PREREQUISITE(S): Completion of foundation or core phase.","Description":"This course is for the IT professional. The emphasis is on examining the models, techniques, and skill development for providing effective IT consulting services. The course examines the structure of IT consulting markets","Years":[null]}},
  			{"CSC 401":{"CourseName":"Introduction to Programming","Prereq":"PREREQUISITE(S): None","Description":"An introduction to programming with a focus on problem solving, structured programming, and algorithm design with a gentle introduction to efficiency. Concepts covered include data types, expressions, variables, assignments, conditional and iterative structures, functions, file input/output, exceptions, namespaces, and recursion.","Years":["Fall 2018-2019","Summer II 2017-2018","Spring 2017-2018","Winter 2017-2018","Fall 2017-2018","Summer II 2016-2017","Summer I 2016-2017","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","Summer II 2015-2016","Spring 2015-2016","Winter 2015-2016","Fall 2015-2016","Summer II 2014-2015","Spring 2014-2015","Fall 2014-2015","Summer II 2013-2014","Spring 2013-2014","Winter 2013-2014","Fall 2013-2014","Spring 2012-2013"]},"CSC 451":{"CourseName":"Database Design for Information Systems","Prereq":"PREREQUISITE(S): None","Description":"Requirement analysis, conceptual design, logical design and implementation of relational databases. Emphasis will be on E-R modeling and E-R mapping, along with basic normalization and SQL for database implementation.","Years":["Fall 2018-2019","Spring 2017-2018","Winter 2017-2018","Fall 2017-2018","Summer I 2016-2017","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","Summer I 2015-2016","Spring 2015-2016","Winter 2015-2016","Fall 2015-2016","Summer I 2014-2015","Spring 2014-2015","Winter 2014-2015","Fall 2014-2015","Summer I 2013-2014","Spring 2013-2014","Winter 2013-2014","Fall 2013-2014","Summer I 2012-2013","Spring 2012-2013"]},"CSC 575":{"CourseName":"Intelligent Information Retrieval","Prereq":"PREREQUISITE(S): CSC 403","Description":"Examination of the design, implementation, and evaluation of information retrieval systems. The focus is on the underlying retrieval models, algorithms, and system implementations. Also examined is how an effective information search and retrieval is interrelated with the organization and description of information to be retrieved. Topics include: automatic indexing","Years":[null]},"HCI 512":{"CourseName":"Information Visualization and Infographics","Prereq":"PREREQUISITE(S): IT 403 and HCI 470","Description":"Communicating information through visualizations. Students learn how to choose effective means to visualize data for (a) their intended audience(s) and (b) for the message they intend to communicate. Students practice creating and evaluating visualizations using a variety of tools and methods.","Years":["Winter 2017-2018","Winter 2016-2017","Winter 2015-2016","Winter 2014-2015","CLOSED Fall 2013-2014"]},"IS 421":{"CourseName":"Systems Analysis","Prereq":"PREREQUISITE(S): None","Description":"Course focus is on both traditional and object oriented systems analysis, with an emphasis upon developing competency in a wide range of modeling techniques. Specific topics include: overview of the software development environment and project management","Years":[null]},"IS 422":{"CourseName":"System Design, Implementation, and Maintenance","Prereq":"PREREQUISITE(S): IS 421 and CSC 451","Description":"Course focus is on both traditional and object oriented systems design. Specific topics include: database design, including logical and physical design","Years":[null]},"IS 430":{"CourseName":"Fundamentals of IT Project Management","Prereq":"PREREQUISITE(S): None","Description":"This course concentrates on monitoring, managing and controlling assets and resources on a single IT project. Topics covered are project methodologies","Years":[null]},"IS 452":{"CourseName":"Big Data and the Internet of Things (Iot)","Prereq":"PREREQUISITE(S): None","Description":"This course surveys system design concepts, techniques, and algorithms in Machine to Machine (M2M), Internet of Things (IoT), and Internet of Everything (IoE). Topics covered include system architecture for big data, sensors and embedded technologies, IoT architecture, consumer vs. industrial IoT, wearable and mobile systems, tracking systems, IoT and big data analytics, market dynamics and entrepreneurial opportunities. Special emphasis is placed on identifying best practices in using big data and IoT through case studies and hands-on exercises.","Years":["Fall 2018-2019","Fall 2017-2018","Spring 2016-2017","Fall 2016-2017","Spring 2015-2016","Fall 2015-2016"]},"IS 456":{"CourseName":"Systems Thinking Perspective for Understanding Business Dynamics","Prereq":"PREREQUISITE(S): IS 421","Description":"This course introduces students to systems thinking and system dynamics modeling for the analysis of business strategy and decision making. Students will learn how to use systems thinking and modeling to visualize and analyze organizations and institutions in terms of the structures and policies that create dynamics and regulate performance. The course will draw on system dynamics modeling and simulation concepts and tools as well as real-world case studies to explain the management of business dynamics.","Years":[]},"IS 536":{"CourseName":"Enterprise Cloud Computing","Prereq":"Prerequisite(s): None","Description":"Cloud concepts, architecture, and service management, with particular emphasis upon identifying and analyzing potential business applications of cloud computing. Students will conduct feasibility studies, detailing the advantages and disadvantages of implementing a cloud computing platform for specific applications, with particular emphasis upon financial considerations, business benefits, and security risks. Students will develop the ability to evaluate alternatives and effectively argue in favor of their choices within the cloud computing knowledge domain. They will be able to define, apply, and defend the need for standards and best practices. Students will work within a project team following the principles of project management to design, build, and implement cloud applications.","Years":["Winter 2017-2018","Winter 2016-2017","Winter 2015-2016","Fall 2014-2015","Fall 2013-2014"]},"IS 549":{"CourseName":"Data Warehousing","Prereq":"PREREQUISTE(S): CSC 451 or CSC 453 or CSC 455","Description":"Introduction to data warehousing and the foundations of understanding the issues involved in building a successful data warehouse. Data warehouse development methodology and issues surrounding the planning of the data warehouse. Data quality and metadata in the data warehouse. Analysis, transformation and loading of data into a data warehouse. Development of the data architecture and physical design. Implementation and administration of the data warehouse.","Years":["Fall 2018-2019","Fall 2017-2018","Winter 2016-2017","Fall 2016-2017","Fall 2015-2016","Fall 2014-2015","Fall 2013-2014"]},"IS 550":{"CourseName":"Enterprise Data Management","Prereq":"PREREQUISITE(S): CSC 451 or CSC 453 or CSC 455","Description":"This course focuses on the technical concepts and managerial knowledge needed to define, integrate and govern centralized and distributed data for a wide range of application systems used at large, multinational corporations. Topics include data repository, data life cycle, DAMA-DMBOK, data stewardship, data asset valuation, enterprise data architecture, data modeling with meta-data, data security standards, master data, and data quality management.","Years":["Fall 2017-2018","Fall 2016-2017"]},"IS 574":{"CourseName":"Business Intelligence","Prereq":"","Description":"Introduction to the concepts of business intelligence (BI) as components and functionality of information systems. How business problems can be solved effectively by using operational data to create data warehouses, and then applying data mining tools and analytics to gain new insights into organizational operations. Detailed discussion of the analysis, design and implementation of systems for BI, including: data management systems, decision support systems, group support systems, knowledge engineering, expert systems, and Web 2.0 tools. Case studies of application software, web tools, success and limitation as well as technical and social issues. (PREREQUISITE(S): (SE 430 or IS 435 or PM 430 or MIS 674) and CS C451","Years":["Fall 2018-2019","Fall 2017-2018","Spring 2016-2017","Fall 2016-2017","Spring 2015-2016","Fall 2015-2016","Winter 2014-2015"]},"IT 411":{"CourseName":"Scripting for Interactive Systems","Prereq":"PREREQUISITE(S): None","Description":"Introductory scripting for developing interactive web pages. Overview of HTML and CSS. Elementary programming concepts using JavaScript for learning control structures, functions, arrays, and object use. User interface development concepts include event handling and use of JavaScript libraries such as jQuery. Review of web clients, servers and architecture.","Years":["Fall 2018-2019","Summer II 2017-2018","Spring 2017-2018","Winter 2017-2018","Fall 2017-2018","Summer II 2016-2017","Summer I 2016-2017","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","Summer II 2015-2016","Spring 2015-2016","Winter 2015-2016","Fall 2015-2016","Summer II 2014-2015","Spring 2014-2015","Fall 2014-2015","Summer II 2013-2014","Spring 2013-2014","Winter 2013-2014","Fall 2013-2014","Spring 2012-2013"]},"IT 403":{"CourseName":"Statistics and Data Analysis","Prereq":"PREREQUISITE(S): None","Description":"Introduction to univariate data analysis methods. Descriptive statistics and data visualization methods. Overview of sampling techniques for data collection, and introduction to statistical inference methods for decision making including simple linear regression, estimation procedures using confidence intervals and hypothesis testing.","Years":[null,null,null,null,null,null,null,null,null]},"IPD 447":{"CourseName":"Big Data Using Hadoop Program","Prereq":"PREREQUISITE(S): None","Description":"A 11-week certificate program covering the Apache Hadoop framework and how it fits with Big Data. This program requires a separate application for admission and $40 application fee. Please visit IPD.CDM.DEPAUL.EDU for information on how to enroll.","Years":[null,null,null,null,null]},"IPD 451":{"CourseName":"Big Data and NoSQL Program","Prereq":"PREREQUISITE(S): None","Description":"A 11-week certificate program covering popular NoSQL databases and how they fit with Big Data. This program requires a separate application for admission and $40 application fee. Please visit IPD.CDM.DEPAUL.EDU for information on how to enroll.","Years":[null,null,null,null]},"IPD 460":{"CourseName":"SQL Server Business Intelligence Program","Prereq":"PREREQUISITE(S): None","Description":"An 11-week in-depth certificate program covering Microsoft SQL Server analysis services, integration services, and reporting services. This program requires a separate application for admission and $40 application fee. Please visit IPD.CDM.DEPAUL.EDU for information on how to enroll.","Years":[null,null,null,null,null]},"GEO 441":{"CourseName":"Geographic Information Systems (Gis) for Community Development","Prereq":"PREREQUISITE(S): None","Description":"This course will focus on applications of Geographic Information Systems (GIS) to community studies and community development. As an amalgam of information technologies (e.g. database management, Web 2.0) and earth measurement technologies (e.g. global positioning systems, remote sensing), GIS is rapidly entering the realm of community development. The course will explain how GIS works","Years":[null]}},
  			{"CSC 401":{"CourseName":"Introduction to Programming","Prereq":"PREREQUISITE(S): None","Description":"An introduction to programming with a focus on problem solving, structured programming, and algorithm design with a gentle introduction to efficiency. Concepts covered include data types, expressions, variables, assignments, conditional and iterative structures, functions, file input/output, exceptions, namespaces, and recursion.","Years":["Fall 2018-2019","Summer II 2017-2018","Spring 2017-2018","Winter 2017-2018","Fall 2017-2018","Summer II 2016-2017","Summer I 2016-2017","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","Summer II 2015-2016","Spring 2015-2016","Winter 2015-2016","Fall 2015-2016","Summer II 2014-2015","Spring 2014-2015","Fall 2014-2015","Summer II 2013-2014","Spring 2013-2014","Winter 2013-2014","Fall 2013-2014","Spring 2012-2013"]},"CSC 451":{"CourseName":"Database Design for Information Systems","Prereq":"PREREQUISITE(S): None","Description":"Requirement analysis, conceptual design, logical design and implementation of relational databases. Emphasis will be on E-R modeling and E-R mapping, along with basic normalization and SQL for database implementation.","Years":["Fall 2018-2019","Spring 2017-2018","Winter 2017-2018","Fall 2017-2018","Summer I 2016-2017","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","Summer I 2015-2016","Spring 2015-2016","Winter 2015-2016","Fall 2015-2016","Summer I 2014-2015","Spring 2014-2015","Winter 2014-2015","Fall 2014-2015","Summer I 2013-2014","Spring 2013-2014","Winter 2013-2014","Fall 2013-2014","Summer I 2012-2013","Spring 2012-2013"]},"CSC 452":{"CourseName":"Database Programming","Prereq":"PREREQUISITE(S): (CSC 453 or CSC 451 or CSC 455) and (CSC 401 or IT 411)","Description":"Programming in a large-scale relational database environment using procedural languages. Topics covered in the course include: procedural extension of query languages, runtime error handling, subprograms (procedures and functions), packages, database triggers, dynamic query language. Optional topics include transaction management, reliability, and security.","Years":["Fall 2018-2019","Spring 2017-2018","Winter 2017-2018","Fall 2017-2018","Summer II 2016-2017","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","Summer II 2015-2016","Spring 2015-2016","Winter 2015-2016","Fall 2015-2016","Summer II 2014-2015","Spring 2014-2015","Winter 2014-2015","Fall 2014-2015","Summer II 2013-2014","Spring 2013-2014","Winter 2013-2014","Fall 2013-2014","Summer II 2012-2013","Spring 2012-2013"]},"CSC 454":{"CourseName":"Database Administration and Management","Prereq":"PREREQUISITE(S): CSC 451 or CSC 453 or CSC 455","Description":"This course is designed to give students a comprehensive foundation in database administration and management. The course provides a conceptual understanding of the database architecture and how its components work and interact with one another. Topics covered in this course include: database architecture, capacity planning, installation and maintenance, network configuration, security management, utilities and tools, industry standards and guidelines, database management techniques and practices.","Years":["Summer II 2017-2018","Winter 2017-2018","Summer II 2016-2017","Winter 2016-2017","Summer II 2015-2016","CLOSED Summer II 2014-2015","Summer II 2013-2014","Spring 2012-2013"]},"CSC 554":{"CourseName":"Advanced Database Management","Prereq":"Prerequisite(s): CSC 453 or CSC 454","Description":"In this class, we will discuss concepts, technologies, guiding principles, processes and best practices in managing database environment to meet high availability, scalability, and compliance needs. Organizations with business critical applications must reduce their risk of downtime, manage database environment efficiently and ensure data meets compliance requirements effectively. IT now has additional responsibilities to secure and manage information in alignment with legal, records management and regulations. This class explores methods and techniques to achieve the availability needs and also focuses on how to protect the database against disasters by maintaining multiple copies of the databases in separate locations, synchronized in real-time. Students learn to design and manage key business resumption functions including disaster recovery plans and business continuity plans. Data governance challenges will be discussed along with solutions including data life cycle management, preservation, retention, and disposition.","Years":["Spring 2017-2018","Spring 2016-2017","Winter 2015-2016","Winter 2014-2015","Winter 2013-2014"]},"CNS 440":{"CourseName":"Information Security Management","Prereq":"PREREQUISITE(S): None","Description":"Survey of information security management as it applies to information systems analysis, design, and operations. Managing information assets and the security infrastructure. Emphasis on managing security-related risk, as well as the process of developing, implementing, and maintaining organizational policies, standards, procedures, and guidelines. Identifying and evaluating information assets, threats, and vulnerabilities. Quantitative and qualitative risk analysis, risk mitigation, residual risk, and risk treatment as they relate to information security. Topics include information security vulnerabilities, threats, and risk management","Years":[null]},"IS 421":{"CourseName":"Systems Analysis","Prereq":"PREREQUISITE(S): None","Description":"Course focus is on both traditional and object oriented systems analysis, with an emphasis upon developing competency in a wide range of modeling techniques. Specific topics include: overview of the software development environment and project management","Years":[null]},"IS 422":{"CourseName":"System Design, Implementation, and Maintenance","Prereq":"PREREQUISITE(S): IS 421 and CSC 451","Description":"Course focus is on both traditional and object oriented systems design. Specific topics include: database design, including logical and physical design","Years":[null]},"IS 430":{"CourseName":"Fundamentals of IT Project Management","Prereq":"PREREQUISITE(S): None","Description":"This course concentrates on monitoring, managing and controlling assets and resources on a single IT project. Topics covered are project methodologies","Years":[null]},"IS 452":{"CourseName":"Big Data and the Internet of Things (Iot)","Prereq":"PREREQUISITE(S): None","Description":"This course surveys system design concepts, techniques, and algorithms in Machine to Machine (M2M), Internet of Things (IoT), and Internet of Everything (IoE). Topics covered include system architecture for big data, sensors and embedded technologies, IoT architecture, consumer vs. industrial IoT, wearable and mobile systems, tracking systems, IoT and big data analytics, market dynamics and entrepreneurial opportunities. Special emphasis is placed on identifying best practices in using big data and IoT through case studies and hands-on exercises.","Years":["Fall 2018-2019","Fall 2017-2018","Spring 2016-2017","Fall 2016-2017","Spring 2015-2016","Fall 2015-2016"]},"IS 505":{"CourseName":"Business Continuity/Disaster Recovery Theories and Strategies","Prereq":"","Description":"This course focuses on the knowledge necessary for an organization to prepare for a variety of major disruptions (floods, earthquakes, terrorist attacks, etc.). The goal is survival of the organization and its daily workflow despite major disruption. Students learn to analyze and prioritize risks and determine criticality ratings that are used to determine survival strategies. Students also learn how to organize employees to respond to a major disruption and how to document recovery plans. Course content includes coverage of current industry trends, as well as planning for the survival of Information Technology functions within an organization.","Years":["Fall 2018-2019","Spring 2017-2018","Winter 2017-2018","Fall 2017-2018","Summer I 2016-2017","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","Summer I 2015-2016","Spring 2015-2016","Winter 2015-2016","Fall 2015-2016","Summer I 2014-2015","Spring 2014-2015","Winter 2014-2015","Fall 2014-2015","Summer I 2013-2014","Spring 2013-2014","Winter 2013-2014","Fall 2013-2014","Summer I 2012-2013","Spring 2012-2013"]},"IS 536":{"CourseName":"Enterprise Cloud Computing","Prereq":"Prerequisite(s): None","Description":"Cloud concepts, architecture, and service management, with particular emphasis upon identifying and analyzing potential business applications of cloud computing. Students will conduct feasibility studies, detailing the advantages and disadvantages of implementing a cloud computing platform for specific applications, with particular emphasis upon financial considerations, business benefits, and security risks. Students will develop the ability to evaluate alternatives and effectively argue in favor of their choices within the cloud computing knowledge domain. They will be able to define, apply, and defend the need for standards and best practices. Students will work within a project team following the principles of project management to design, build, and implement cloud applications.","Years":["Winter 2017-2018","Winter 2016-2017","Winter 2015-2016","Fall 2014-2015","Fall 2013-2014"]},"IS 549":{"CourseName":"Data Warehousing","Prereq":"PREREQUISTE(S): CSC 451 or CSC 453 or CSC 455","Description":"Introduction to data warehousing and the foundations of understanding the issues involved in building a successful data warehouse. Data warehouse development methodology and issues surrounding the planning of the data warehouse. Data quality and metadata in the data warehouse. Analysis, transformation and loading of data into a data warehouse. Development of the data architecture and physical design. Implementation and administration of the data warehouse.","Years":["Fall 2018-2019","Fall 2017-2018","Winter 2016-2017","Fall 2016-2017","Fall 2015-2016","Fall 2014-2015","Fall 2013-2014"]},"IS 550":{"CourseName":"Enterprise Data Management","Prereq":"PREREQUISITE(S): CSC 451 or CSC 453 or CSC 455","Description":"This course focuses on the technical concepts and managerial knowledge needed to define, integrate and govern centralized and distributed data for a wide range of application systems used at large, multinational corporations. Topics include data repository, data life cycle, DAMA-DMBOK, data stewardship, data asset valuation, enterprise data architecture, data modeling with meta-data, data security standards, master data, and data quality management.","Years":["Fall 2017-2018","Fall 2016-2017"]}},
			{"CSC 452":{"CourseName":"Database Programming","Prereq":"PREREQUISITE(S): (CSC 453 or CSC 451 or CSC 455) and (CSC 401 or IT 411)","Description":"Programming in a large-scale relational database environment using procedural languages. Topics covered in the course include: procedural extension of query languages, runtime error handling, subprograms (procedures and functions), packages, database triggers, dynamic query language. Optional topics include transaction management, reliability, and security.","Years":["Fall 2018-2019","Spring 2017-2018","Winter 2017-2018","Fall 2017-2018","Summer II 2016-2017","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","Summer II 2015-2016","Spring 2015-2016","Winter 2015-2016","Fall 2015-2016","Summer II 2014-2015","Spring 2014-2015","Winter 2014-2015","Fall 2014-2015","Summer II 2013-2014","Spring 2013-2014","Winter 2013-2014","Fall 2013-2014","Summer II 2012-2013","Spring 2012-2013"]},"CSC 454":{"CourseName":"Database Administration and Management","Prereq":"PREREQUISITE(S): CSC 451 or CSC 453 or CSC 455","Description":"This course is designed to give students a comprehensive foundation in database administration and management. The course provides a conceptual understanding of the database architecture and how its components work and interact with one another. Topics covered in this course include: database architecture, capacity planning, installation and maintenance, network configuration, security management, utilities and tools, industry standards and guidelines, database management techniques and practices.","Years":["Summer II 2017-2018","Winter 2017-2018","Summer II 2016-2017","Winter 2016-2017","Summer II 2015-2016","CLOSED Summer II 2014-2015","Summer II 2013-2014","Spring 2012-2013"]},"CSC 543":{"CourseName":"Spatial Databases and Geographic Information Systems","Prereq":"Prerequisites: CSC 453 or CSC 455","Description":"This course considers how spatial databases work within a GIS, how data is structured, stored, indexed, retrieved, and displayed. Other topics may include fuzzy spatial databases, temporal spatial databases, and multiple criteria spatial decision making. The class will consist of hands-on work with commercial products, as well as investigating the state of-the art research in the field.","Years":["Spring 2016-2017"]},"CSC 549":{"CourseName":"Database System Implementation","Prereq":"PREREQUISITE(S): CSC 453","Description":"This is an advanced database course that covers issues in DBMS implementation. Topics covered in this course include: physical data organizations, indexing and hashing, query processing and optimization, database recovery techniques, transaction management, concurrency control, and security.","Years":["Fall 2013-2014"]},"CSC 551":{"CourseName":"Distributed Database Systems","Prereq":"PREREQUISITE(S): CSC 453 and (CSC 435 or TDC 405 or TDC 463)","Description":"Distributed database architecture, distributed database design, distributed query processing, query decomposition and optimization of distributed queries, distributed transaction management and concurrency control, distributed DBMS reliability, distributed database operating systems. Distributed multidatabase systems. Client/Server database systems.","Years":[]},"CSC 553":{"CourseName":"Advanced Database Concepts","Prereq":"PREREQUISITE(S): CSC 453.","Description":"An introduction to advanced selected topics in databases. The topics include: intelligent and deductive databases, temporal databases, multimedia databases, spatial and geographic databases, fuzzy databases, mobile databases, data mining and data warehousing, as well as emerging issues and concepts in database design, implementation and management.","Years":["Winter 2017-2018","Winter 2016-2017","Winter 2015-2016","Spring 2014-2015","Winter 2013-2014"]},"CSC 554":{"CourseName":"Advanced Database Management","Prereq":"Prerequisite(s): CSC 453 or CSC 454","Description":"In this class, we will discuss concepts, technologies, guiding principles, processes and best practices in managing database environment to meet high availability, scalability, and compliance needs. Organizations with business critical applications must reduce their risk of downtime, manage database environment efficiently and ensure data meets compliance requirements effectively. IT now has additional responsibilities to secure and manage information in alignment with legal, records management and regulations. This class explores methods and techniques to achieve the availability needs and also focuses on how to protect the database against disasters by maintaining multiple copies of the databases in separate locations, synchronized in real-time. Students learn to design and manage key business resumption functions including disaster recovery plans and business continuity plans. Data governance challenges will be discussed along with solutions including data life cycle management, preservation, retention, and disposition.","Years":["Spring 2017-2018","Spring 2016-2017","Winter 2015-2016","Winter 2014-2015","Winter 2013-2014"]},"CSC 555":{"CourseName":"Mining Big Data","Prereq":"PREREQUISITE(S): ((CSC 401 and ( CSC 453 or DSC 450) and (DSC 441 or DSC 478)) or (MAT 491 and MAT 449))","Description":"Introduction to fundamentals of distributed file systems and map-reduce technology (e.g., Hadoop)","Years":[null]},"CSC 575":{"CourseName":"Intelligent Information Retrieval","Prereq":"PREREQUISITE(S): CSC 403","Description":"Examination of the design, implementation, and evaluation of information retrieval systems. The focus is on the underlying retrieval models, algorithms, and system implementations. Also examined is how an effective information search and retrieval is interrelated with the organization and description of information to be retrieved. Topics include: automatic indexing","Years":[null]},"CSC 589":{"CourseName":"Topics in Database","Prereq":"PREREQUISITE(S): For specific prerequisites, see syllabus or consult with course instructor. (variable credit)","Description":"Specific topics will be selected by the instructor and may vary with each quarter. Can be repeated for credit. Variable credit.","Years":[]}},
			{"CSC 423":{"CourseName":"Data Analysis and Regression","Prereq":"PREREQUISITE(S): IT 403","Description":"Multiple regression and correlation, residual analysis, analysis of variance, and robustness. These topics will be studied from a data analytic perspective, supported by an investigation of available statistical software.","Years":[null,null,null,null]},"CSC 481":{"CourseName":"Introduction to Image Processing","Prereq":"PREREQUISITE(S): CSC 412 or consent of instructor","Description":"The course is a prerequisite for more advanced Visual Computing (VC) courses and the students will be challenged to implement VC algorithms for real world applications. The topics covered in the course include: components of an image processing system and its applications, elements of visual perception, sampling and quantization, image enhancement by histogram equalization, color spaces and transformations, introduction to segmentation (Edge detection), and morphological image processing.","Years":["Fall 2018-2019","Fall 2016-2017","Fall 2015-2016","Fall 2014-2015","Fall 2013-2014"]},"CSC 482":{"CourseName":"Applied Image Analysis","Prereq":"PREREQUISITE(S) CSC 481","Description":"Fundamentals of computational image analysis will be explored in terms of its two most important components, image information extraction and modeling of image patterns. These components will be studied in the context of image representation, segmentation, classification, retrieval and recognition. The course will be useful for students interested in image analysis related to areas such as image databases, multimedia management, animation, GIS, computer graphics, medical imaging, remote sensing and robotics. Specific topics include, but are not limited to segmentation, multi-scale representation, shape analysis, texture analysis, Fourier analysis, wavelets, Gabor and fractal analysis, template matching, and object recognition.","Years":["Winter 2017-2018","Winter 2016-2017","Winter 2014-2015","Winter 2013-2014"]},"CSC 555":{"CourseName":"Mining Big Data","Prereq":"PREREQUISITE(S): ((CSC 401 and ( CSC 453 or DSC 450) and (DSC 441 or DSC 478)) or (MAT 491 and MAT 449))","Description":"Introduction to fundamentals of distributed file systems and map-reduce technology (e.g., Hadoop)","Years":[null]},"CSC 575":{"CourseName":"Intelligent Information Retrieval","Prereq":"PREREQUISITE(S): CSC 403","Description":"Examination of the design, implementation, and evaluation of information retrieval systems. The focus is on the underlying retrieval models, algorithms, and system implementations. Also examined is how an effective information search and retrieval is interrelated with the organization and description of information to be retrieved. Topics include: automatic indexing","Years":[null]},"CSC 578":{"CourseName":"Neural Networks and Deep Learning","Prereq":"PREREQUISITE(S): (CSC 412 and DSC 478) or (CSC 403 and DSC 441)","Description":"Course focuses on the algorithms, implement, and application of neural networks for learning about data. It will present how neural networks represent data and learn in supervised and unsupervised contexts with applications to language processing, classification, and regression problems. Topics include learning algorithms, and optimization methods, deep learning methods for deriving deep representations from surface features, recursive networks, Boltzmann machines and convolutional networks.","Years":["Fall 2018-2019","Fall 2016-2017","Fall 2015-2016","Fall 2014-2015","Fall 2013-2014"]},"CSC 594":{"CourseName":"Topics in Artificial Intelligence","Prereq":"PREREQUISITE(S): For specific prerequisites, see syllabus or consult course instructor. (variable credit)","Description":"Specific topics will be selected by the instructor and may vary with each quarter. Can be repeated for credit. Variable credit.","Years":[null,null,"Spring 2015-2016",null,null]},"CSC 598":{"CourseName":"Topics in Data Analysis","Prereq":"PREREQUISITE(S): For specific prerequisites, see syllabus or consult course instructor. (variable credit)","Description":"Specific topics will be selected by the instructor and may vary with each quarter. Can be repeated for credit. Variable credit.","Years":[]}},
			{"GPH 436":{"CourseName":"Fundamentals of Computer Graphics","Prereq":"PREREQUISITE(S): CSC 393 and MAT 150.","Description":"An accelerated introduction to the graphics development environments and to graphical programming. Provides an in depth discussion of the basic mathematical language of computer graphics: vectors, transformations, homogeneous coordinates and their associated data structures. Advanced topics will include sampling theory and interpolation. Also provides a basic introduction to industry standards in graphics development, including specifying transformations and viewing parameters.","Years":["Fall 2014-2015","Fall 2013-2014"]},"GPH 469":{"CourseName":"Computer Graphics Development","Prereq":"PREREQUISITE(S): CSC 461 and (GAM 425 or GPH 436)","Description":"Basic graphics architecture. Coordinate systems. Three-dimensional representations and transformations. Simple visible-surface algorithms. Introduction to illumination. Gouraud and Phong shading. Antialiasing. Texture mapping and elements of animation. Students create a graphics package using a high-level graphics API such as OpenGL.","Years":["Winter 2015-2016","Winter 2014-2015","CLOSED Fall 2014-2015","Fall 2013-2014"]},"GPH 570":{"CourseName":"Visualization","Prereq":"PREREQUISITE(S): GPH 469 or GAM 470","Description":"(Formerly CSC 570) Reconstruction techniques. Voxel classification and isosurface generation. Spatial set operations. Projections of higher-dimensional data sets. Data feature enhancement. False color mapping. Survey of applications in science, engineering and medicine.","Years":[]},"GPH 572":{"CourseName":"Principles of Computer Animation","Prereq":"PREREQUISITE(S): GPH 469.","Description":"(Formerly CSC 572) This course will cover a range of topics in introductory 3D Computer Animation. Topics covered will include key framing, interpolation, hierarchies, inverse kinematics, particle systems, and the basics of physically based simulation and modeling.","Years":["Spring 2012-2013"]},"GPH 580":{"CourseName":"Hardware Shading Techniques","Prereq":"Prerequisites: GPH 469 or GAM 470","Description":"This class explores the current trends in programmable computer graphics hardware. Modern graphics processing units (GPU's) are becoming increasingly powerful and fully programmable parallel processing units. They make extremely sophisticated effects in computer graphics, such as shadows, displacement maps, skinning, motion blur, reflections and refractions, possible in real-time scenes. In addition these increasingly general programmable units are being used for far more general computing problems from traditional searching and sorting algorithms to computational problems in physics such as the diffusion equation and fluid flow. In this course we will explore the applications of hardware shading to computer graphics, including advanced lighting, shading and surface effects. As time allows, we will explore other applications such as physics and computer science.","Years":["Spring 2014-2015","Spring 2013-2014","Spring 2012-2013"]},"CSC 461":{"CourseName":"Optimized C++","Prereq":"PREREQUISITE(S): CSC 400 and CSC 403 and CSC 406","Description":"Analysis and implementation techniques to improve the performance and resource usage of C++ programs. This class will provide low level understanding of C++'s internal behavior that can be exploited to create faster performing software. Analysis of existing software to help identify and remedy execution performance issues related to data layout, processor caching, unintended compiler interactions, algorithmic considerations, data containers and supplied subsystems. Topics include: performance enhancements through SIMD instruction set, dynamic memory usage, caching, implicit behavior, C++ language extensions, algorithms, streaming and profiling.","Years":["Fall 2018-2019","Fall 2017-2018","Spring 2016-2017","Fall 2016-2017","Fall 2015-2016","Fall 2014-2015"]},"CSC 462":{"CourseName":"Optimized C++ Multithreading","Prereq":"PREREQUISITE(S): GAM 491 or CSC 461","Description":"Software architecture of applied C++ concurrency and multithreading fundamentals. Basic threading concepts: process model, threads, stacks, fibers, mutexes, semaphores, atomics and events. Leveraging advanced C++ language features relating to the memory model and the threading support in large multithreaded architectures. Architecting lock-based and lock-free concurrent data structures in applications. Designing a threaded management system to control the access and reuse of threads in applications. Designing multithreaded architecture for real-time performance.","Years":["Fall 2018-2019","Spring 2014-2015"]},"CSC 486":{"CourseName":"Real-Time Networking (Formerly GAM 490)","Prereq":"PREREQUISITE(S): CSC 461 and (SE 456 or SE 450)","Description":"Applied real-time networking fundamentals. Topics include low-level TCP/UDP socket programming, serialization of data for network transportation, deterministic data flow and queuing in applications, dynamic configuration and session communications. Students will explore issues related to performance-based networking in different topologies: client/server and peer to peer. Students will create and build real-time applications using different protocols (TCP, UDP, RUDP) with active network simulation of loss, delayed, corrupted and out of order data packets. Architecture of different bandwidth compression and estimation techniques will be investigated. Research of wireless ad hoc networks such as Bluetooth and ZigBee will be explored.","Years":["Spring 2017-2018"]},"CSC 588":{"CourseName":"Real-Time Multithreaded Architecture","Prereq":"PREREQUISITE(S): CSC 461 and (SE 456 or SE 450)","Description":"Real-time constrained multithreaded architecture. Topics include multithreaded handle development, inter-thread communication, creating systems for user-defined callbacks, asynchronous loading and streaming of resources, non-blocking threading synchronization, design patterns and data driven messaging with time delivery constraints. Design and implementation of thread safe data management with atomic non-blocking synchronization. Exploration of real-time data driven messaging to allowing the run-time object data to control the behavior an application. Students will design, develop and implement a multithreaded real-time application (i.e. Audio engine) that integrates existing single and multithreaded middleware libraries.","Years":["Spring 2017-2018"]},"SE 456":{"CourseName":"Architecture of Real-Time Systems","Prereq":"PREREQUISITE(S): CSC 403","Description":"This course discusses the principles, styles, and patterns of real-time software architecture. Trade-offs and ramifications of software architecture with respect to performance, maintainability, and reusability, will be explored. The course will also investigate the design and implementation of real-time behavior and constraints for Common Design Patterns such as Observer, Visitor, and Strategy. Finally, the course will demonstrate how creation of real-time Data Driven environment allows the run-time object data to control the behavior and flow of an application. These topics will be discussed in the context of best practices in software engineering such as iterative development, testing, and continuous integration.","Years":[null,null,null,null,null,null,null,null]},"GAM 425":{"CourseName":"Applied 3D Geometry","Prereq":"PREREQUISITE(S): CSC 403","Description":"Review of mathematical foundation and techniques needed for the development of 3D graphics and game systems. This class will provide the foundation in linear algebra and 3D geometry required for implementing common tasks in 3D graphics and game systems. Topics include: vectors, matrices, transforms, coordinate changes, projections, intersection, interpolation and random number generator.","Years":[null,null,null,null,null,null,null,null]},"GAM 450":{"CourseName":"Physics for Game Developers","Prereq":"PREREQUISITE(S): CSC 461 and (SE 456 or SE 450)","Description":"The course concentrates on Newton's Laws of Motion, kinematics and kinetics. This theory will be applied to problems that a game programmer must understand e.g. collisions between objects, projectiles and their trajectories, real-time simulation of motion. Special objects such as cars, aircraft and ships will be discussed. Students will apply and implement laws of physics.","Years":[null,null,null,null,null,null,null,null]},"GAM 453":{"CourseName":"Tool Programming for Game Development","Prereq":"PREREQUISITE(S): CSC 461 and (SE 456 or SE 450)","Description":"This course focuses on the parsing and conditioning of game related assets for real-time game engines. Topics include the content pipeline, processing or standard file formats using modern API, integration of external tools, run-time file format design, command line and graphical user interfaces. Adaptive real-time modification of data structures in game using managed languages (such as C#) reflection will be explored.","Years":[null,null,null,null,null,null,null,null]},"GAM 470":{"CourseName":"Rendering and Graphics Programming","Prereq":"PREREQUISITE(S): GAM 425 and CSC 461","Description":"This programming class will present the rendering pipeline and basic shader creation. Students will create their own graphics package using a high-level graphics API such as Direct X. Performance issues will be considered as part of the API design. Topics covered include illumination techniques, Gouraud and Phong shading, antialiasing techniques, texture mapping, blending and environment mapping, reflection and hardware instancing.","Years":[null,null,null,null,null,null,null,null]},"GAM 475":{"CourseName":"Game Engine Programming I","Prereq":"PREREQUISITE(S): CSC 461 and (SE 456 or SE 450)","Description":"This course designs and implements a custom real-time game engine. Developing real-time graphics systems to transform and render scene graphs using polygon primitives and hardware buffers. Architecting critical performance related operating system components such as Memory, File, Object and Math Systems. Designing large scale software architecture using Design Patterns, layers and libraries into one large project.","Years":[null,null,null,null,null,null,null,null]},"GAM 476":{"CourseName":"Artificial Intelligence for Computer Games","Prereq":"PREREQUISITE(S): CSC 461 and (SE 456 or SE 450)","Description":"Artificial Intelligence (AI) is one of the essential components of a computer game. The course introduces basic concepts of AI. Emphasis will be placed on applications of AI in various genres of computer games. In the implementation component of this course students will be exposed to the existing AI game engines (middleware), which contain implemented AI algorithms that are ready to be applied into game code. These algorithms include: decision trees, pathfinding, neural networks, and script-driven game object behaviors.","Years":[null,null,null,null,null,null,null,null]},"GAM 486":{"CourseName":"Game Programming for Mobile Devices","Prereq":"PREREQUISITE(S): CSC 471","Description":"In this course we introduce major mobile hardware platforms and their operating systems. Issues related to game design for handheld devices will be presented. The strong technical component of this course includes game programming for a handheld device with a wireless internet connection enabling multiplayer game architecture. Such concepts as: building a custom game library, multiplayer game programming, infrared, wireless and socket communication between devices will be discussed.","Years":[null,null,null,null,null,null,null,null]},"GAM 575":{"CourseName":"Game Engine Programming II","Prereq":"PREREQUISITE(S): GAM 475","Description":"This class continues to explore C/C++ game engine programming. This course focuses on 3D keyframe animation systems and 3D model asset conversion. Topics include design of an extensive Math library including Quaternion interpolation, view volume determination, exporting and conditioning of parent relative keyframe animation data, and run-time animation engine. Finally implementation of run-time data formats for vertex buffer objects will be developed for efficient rendering.","Years":[null,null,null,null,null,null,null,null]},"GAM 576":{"CourseName":"Game Engine Programming III","Prereq":"PREREQUISITE(S): GAM 575","Description":"This class continues to explore C/C++ game engine programming. This class focuses on advanced game engine issues such as tool development (skin data reduction, adaptive animation compression, model conversion), runtime coordination on CPU (scene graph, animation coordination, resource management) and GPU processing (vertex skinning, animation blending and model rendering).","Years":[null,null,null,null,null,null,null,null]},"GAM 690":{"CourseName":"Game Development Studio I","Prereq":"PREREQUISITE: GAM 475","Description":"In this course and its continuation GAM 691, students will work in small teams to design and implement a computer game. The courses must be taken consecutively.","Years":[null,null,null,null,null,null,null,null]},"GAM 691":{"CourseName":"Game Development Studio II","Prereq":"PREREQUISITE: GAM 474 or SE 456 (variable credit)","Description":"Continuation of GAM 690.","Years":[null,null,null,null,null,null,null,null]}},
			{"CSC 436":{"CourseName":"Web Applications","Prereq":"PREREQUISITE(S): CSC 435 and CSC 447","Description":"This course covers the design and development of modern web applications and their interaction with web services. The primary focus is on client-side web applications using AJAX-techniques to access web services. Possible topics include: HTML5","Years":[null]},"CSC 438":{"CourseName":"Framework for Web Application Development","Prereq":"PREREQUISITE: CSC 407","Description":"This course introduces concepts, techniques, technologies and APIs for web application development. The main focus of the course is on the Model-View-Controller design pattern employed by modern full-stack web frameworks. Concepts and techniques covered include client/server programming, database abstraction APIs, and asynchronous javascript. Examples of full-stack MVC frameworks include Ruby-on-Rails (written in Ruby), Django and TurboGears (written in Python).","Years":["Fall 2018-2019","Spring 2015-2016","Fall 2015-2016","Fall 2014-2015","Fall 2013-2014"]},"CSC 471":{"CourseName":"Mobile Application Development for iOS","Prereq":"PREREQUISITE(S): CSC 403 and CSC 407","Description":"This course introduces the core issues associated with application development for mobile devices using the iOS platform. Students will learn the Swift language, the XCode IDE, UIKit and other frameworks, the elements and architecture of the user interfaces, and more. Students will be exposed to the iOS system architecture including memory management, MVC, delegates and threads. Topics will also include understanding and handling of multi-touch events, gestures, and motion events.","Years":["Winter 2017-2018","Winter 2016-2017","Winter 2015-2016","Spring 2014-2015","Spring 2013-2014","CLOSED Fall 2013-2014","Spring 2012-2013"]},"CSC 472":{"CourseName":"Mobile Application Development for Android","Prereq":"PREREQUISITE(S): CSC 403 and CSC 407","Description":"This course introduces the core issues associated with application development for mobile devices using the Android platform. Students will learn the Eclipse IDE, frameworks, the elements and architecture of user interfaces, graphics, and more. Students will be exposed to the Android system architecture, including Views, Widgets, Resources, Adapters, Intents and Activities. Topics will also include understanding and handling of threads, multi-touch events, gestures, and motion events.","Years":["Fall 2018-2019","Fall 2016-2017","Fall 2015-2016","Fall 2014-2015"]},"CSC 491":{"CourseName":"Mobile Application Development for iOS II","Prereq":"PREREQUISITE(S): CSC 471","Description":"This course will cover advanced topics in mobile application development for iOS. The topics covered will be made explicit by the course instructor when the course is offered.","Years":["Spring 2017-2018","Spring 2016-2017"]},"CSC 492":{"CourseName":"Mobile Application Development for Android II","Prereq":"PREREQUISITE(S): CSC 472","Description":"This course will cover advanced topics in mobile application development for Android. The topics covered will be made explicit by the course instructor when the course is offered.","Years":[]},"HCI 430":{"CourseName":"Prototyping and Implementation","Prereq":"PREREQUISITE(S): IT 411. Students must have completed or be concurrently enrolled in HCI 440 or HCI 441 to register for this course.","Description":"Overview of prototyping methods ranging from low-fidelity to interactive script-based prototypes. Analysis of prototyping tools and their relative advantages. Projects include prototype development over multiple iterations using a variety of strategies.","Years":["Fall 2018-2019","Winter 2017-2018","Fall 2017-2018","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","Spring 2015-2016","Winter 2015-2016","CLOSED Fall 2015-2016"]},"HCI 440":{"CourseName":"Introduction to User-Centered Design","Prereq":"PREREQUISITE(S): None","Description":"The user-interface development process. Introduction to methods for practicing user-centered design including user and task analysis, user interface design principles and testing using low-fidelity prototypes. Students may not receive credit for this course and HCI 441.","Years":["Fall 2018-2019","Spring 2017-2018","CLOSED Winter 2017-2018","Fall 2017-2018","Summer 10 week 2016-2017","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","CLOSED Summer 10 week 2015-2016","CLOSED Spring 2015-2016","Spring 2014-2015","Fall 2014-2015","Summer 10 week 2013-2014","Winter 2013-2014","Fall 2013-2014","Spring 2012-2013"]},"HCI 441":{"CourseName":"Introduction to User-Centered Development","Prereq":"PREREQUISITE(S): CSC 403","Description":"Overview of the user-centered design (UCD) process with an additional emphasis on user interface development. Coverage of UCD process includes effective, low-cost methods for user research, interaction design and evaluation. User interface development involves application of front-end development languages (HTML and JavaScript) and frameworks (jQery). This course is offered to students with programming experience as an alternative to IT 411 and HCI 440. Students may not receive credit for this course and HCI 440.","Years":[]},"HCI 454":{"CourseName":"Interaction Design and Information Architecture","Prereq":"PREREQUISITE(S): HCI 406 and (HCI 440 or HCI 441)","Description":"Information architecture and interactive page design. Perception and use of menus, labels and user controls. Structuring information for navigation and presentation. Selecting and placing user controls for optimizing task flow on pages and across pages. Creating wire frames and using content managers.","Years":["Fall 2018-2019","Spring 2017-2018","Winter 2017-2018","Fall 2017-2018","Summer 10 week 2016-2017","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","Spring 2015-2016","Winter 2015-2016","Fall 2015-2016","Spring 2014-2015","Winter 2014-2015","Fall 2014-2015","Spring 2013-2014","Winter 2013-2014","Fall 2013-2014","Spring 2012-2013"]}},
			{"CNS 440":{"CourseName":"Information Security Management","Prereq":"PREREQUISITE(S): None","Description":"Survey of information security management as it applies to information systems analysis, design, and operations. Managing information assets and the security infrastructure. Emphasis on managing security-related risk, as well as the process of developing, implementing, and maintaining organizational policies, standards, procedures, and guidelines. Identifying and evaluating information assets, threats, and vulnerabilities. Quantitative and qualitative risk analysis, risk mitigation, residual risk, and risk treatment as they relate to information security. Topics include information security vulnerabilities, threats, and risk management","Years":[null]},"ECT 556":{"CourseName":"Enterprise Architecture and Design","Prereq":"Prerequisites: ECT 424 and SE 430","Description":"This is an advanced course on the design and planning of enterprise architecture that enables intra-/multi-enterprise collaboration and interoperability. The emphasis is on the alignment between IT and organizational objectives through the integration of business architectures, data and information architecture, application architecture, technology architecture, interfaces and infrastructure. Topics include: frameworks, tools, and methodologies for enterprise architecture design","Years":[null]},"IS 440":{"CourseName":"Collaborative Technologies for Leading Projects","Prereq":"PREREQUISITE(S): None","Description":"Study of the process of virtual teaming with emphasis on facilitation of different time project activities and facilitation of same time meetings. Students will learn how small group psychology and group communication theories inform specific behaviors in the design and leadership of meetings. Several meeting types including information briefing, focus group, document writing, decision making, requirements gathering, and teaching/training will be explored. In addition, the course surveys current collaboration technologies and discusses how to select among those technologies usability and fit to purpose of a meeting agenda. DL students may be required to schedule same time sessions with the instructor and other DL students","Years":[null]},"IS 444":{"CourseName":"IT Auditing","Prereq":"PREREQUISITE(S): None","Description":"Management and boards continue to recognize the importance of effectively managing information technology (IT) assets - to meet business objectives and to thoughtfully manage IT related business risks. This course examines the key principles related to auditing information technology processes and related controls and is designed to meet the ever increasing needs of IT audit and IT governance professionals. In addition, this course aids in the preparation for the Certified Information Systems Auditor (CISA) exam.","Years":["Fall 2018-2019","Fall 2017-2018","Spring 2016-2017","Fall 2016-2017","Spring 2015-2016","Fall 2015-2016","Spring 2014-2015","Fall 2014-2015","Spring 2013-2014","Fall 2013-2014","Spring 2012-2013"]},"IS 482":{"CourseName":"Legal Responsibilities in Information Technology","Prereq":"PREREQUISITE(S): None","Description":"This course examines the legal standards to which people and organizations are held under laws and regulations that concern computing and information technology. This course is a complement to CNS 477, which focuses on governance policies and business costs. Topics include government and laws, business regulations, healthcare regulations, education regulations, data breach reporting and notification, privacy laws, laws of search and seizure, freedom of speech and association, defamation, cyber crimes, contracts, and intellectual property.","Years":["Fall 2018-2019","Spring 2012-2013"]},"IS 483":{"CourseName":"Information Services and Operations","Prereq":"PREREQUISITE(S): Completion of five or more SoC MS level courses is required.","Description":"This course focuses on the operational aspects of information systems in organizations by examining the concepts, tools and techniques available to IS professionals responsible for the delivery of IT services. Topics include the organization of the IT services","Years":[null]},"IS 500":{"CourseName":"Information Technology Leadership","Prereq":"PREREQUISITE(S): IS 430 OR PM 430 OR SE 477","Description":"Managing people ethically and effectively by applying a broad range of creative approaches to individual and team leadership within an Information Technology context. Leadership methods studied include trait-based, skills-based, situational, contingency theory, path-goal theory, leader-member exchange theory, transformational, psychodynamic, and authentic leadership, as well as team leadership and the international, cultural, and ethical dimensions of leadership. Students assess their leadership styles and design individualized development plans to strengthen existing skills and expand IT leadership capabilities by incorporating additional leadership dimensions.","Years":["Spring 2017-2018","Spring 2016-2017","Spring 2015-2016","Spring 2014-2015","Fall 2014-2015","Spring 2013-2014","CLOSED Spring 2012-2013"]},"IS 505":{"CourseName":"Business Continuity/Disaster Recovery Theories and Strategies","Prereq":"","Description":"This course focuses on the knowledge necessary for an organization to prepare for a variety of major disruptions (floods, earthquakes, terrorist attacks, etc.). The goal is survival of the organization and its daily workflow despite major disruption. Students learn to analyze and prioritize risks and determine criticality ratings that are used to determine survival strategies. Students also learn how to organize employees to respond to a major disruption and how to document recovery plans. Course content includes coverage of current industry trends, as well as planning for the survival of Information Technology functions within an organization.","Years":["Fall 2018-2019","Spring 2017-2018","Winter 2017-2018","Fall 2017-2018","Summer I 2016-2017","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","Summer I 2015-2016","Spring 2015-2016","Winter 2015-2016","Fall 2015-2016","Summer I 2014-2015","Spring 2014-2015","Winter 2014-2015","Fall 2014-2015","Summer I 2013-2014","Spring 2013-2014","Winter 2013-2014","Fall 2013-2014","Summer I 2012-2013","Spring 2012-2013"]},"IS 506":{"CourseName":"Business Continuity/Disaster Recovery Management and Tactics","Prereq":"PREREQUISITE(S): IS 505","Description":"The course prepares students to lead an organization's business continuity and disaster recovery plans. Students learn the methodology needed to organize this function within an organization, evaluate an organization's business continuity and disaster recovery program according to established industry standards, and conduct a variety of quick-recovery drills. Students also focus upon industry-related human resources issues, crisis communications, and policies and procedures for setting up a command center. Course content includes coverage of current industry trends, as well as managing the survival of Information Technology functions within an organization.","Years":["Summer II 2017-2018","Summer II 2016-2017","Summer II 2015-2016","Winter 2015-2016","Summer II 2014-2015","Winter 2014-2015","Summer II 2013-2014","Winter 2013-2014","Summer II 2012-2013"]},"IS 535":{"CourseName":"Information Technology Investment Financial Analysis","Prereq":"PREREQUISITE(S): SE 477 or IS 565 or ACCT 500 or IS 430 or PM 430 or ECT 455","Description":"This course focuses on the application of financial analysis and decision-making approaches to aid information technology investment decisions at the operational, project, tactical and strategic levels. Students will learn how to apply a variety of financial methods -- breakeven analysis, present value analysis, profitability index, and return on investment to various IT investment decisions. The course will also address cost benefit analysis, outsourcing, balanced scorecard, and multi-factor scoring, benchmarking, and IT investment portfolio methods. These techniques will prepare students to manage capital budgets, acquisition of system and application software, hardware, personnel, and professional services at project and system levels as well as enterprise investment portfolio.","Years":["Fall 2018-2019","Fall 2017-2018","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","Spring 2015-2016","Winter 2015-2016","Fall 2015-2016","Spring 2014-2015","Winter 2014-2015","Fall 2014-2015","Spring 2013-2014","Winter 2013-2014","Fall 2013-2014","Spring 2012-2013"]},"IS 536":{"CourseName":"Enterprise Cloud Computing","Prereq":"Prerequisite(s): None","Description":"Cloud concepts, architecture, and service management, with particular emphasis upon identifying and analyzing potential business applications of cloud computing. Students will conduct feasibility studies, detailing the advantages and disadvantages of implementing a cloud computing platform for specific applications, with particular emphasis upon financial considerations, business benefits, and security risks. Students will develop the ability to evaluate alternatives and effectively argue in favor of their choices within the cloud computing knowledge domain. They will be able to define, apply, and defend the need for standards and best practices. Students will work within a project team following the principles of project management to design, build, and implement cloud applications.","Years":["Winter 2017-2018","Winter 2016-2017","Winter 2015-2016","Fall 2014-2015","Fall 2013-2014"]},"IS 540":{"CourseName":"Global Information Technology","Prereq":"PREREQUISITE(S): Completion of five or more SoC MS level courses is required.","Description":"A study of the hardware, software, and techniques for using virtual information technologies to support teams working in a distributed, virtual, or global environments. Topics include software survey and evaluation, software deployment within organizational and trans-organizational contexts, trans-national vendor relationships, trans-border data flow, geographically dispersed software development, and integration of diverse technologies.","Years":["Winter 2016-2017","Winter 2015-2016","Winter 2014-2015","Winter 2013-2014"]},"IS 550":{"CourseName":"Enterprise Data Management","Prereq":"PREREQUISITE(S): CSC 451 or CSC 453 or CSC 455","Description":"This course focuses on the technical concepts and managerial knowledge needed to define, integrate and govern centralized and distributed data for a wide range of application systems used at large, multinational corporations. Topics include data repository, data life cycle, DAMA-DMBOK, data stewardship, data asset valuation, enterprise data architecture, data modeling with meta-data, data security standards, master data, and data quality management.","Years":["Fall 2017-2018","Fall 2016-2017"]},"IS 560":{"CourseName":"Enterprise Systems","Prereq":"PREREQUISITE(S): Advanced Standing","Description":"An introduction to enterprise systems for data and process integration, including ERP systems. Topics include the requirements of enterprise systems, application architecture, tools, and functionality of leading enterprise systems, life cycle and methodologies for systems integration, selection, and implementation strategies. Also addressed are emerging trends for enterprise systems and relationship among component systems.","Years":["Fall 2018-2019","CLOSED Fall 2017-2018","Spring 2016-2017","Fall 2016-2017","Spring 2015-2016","Fall 2015-2016","Spring 2014-2015","CLOSED Fall 2014-2015","CLOSED Spring 2013-2014","CLOSED Fall 2013-2014","Spring 2012-2013"]},"IS 565":{"CourseName":"IT Outsourcing","Prereq":"PREREQUISITE(S): Completion of five or more SoC MS level courses is required","Description":"The course focuses on how organizations can use leverage of scale as a source for cost reduction","Years":[null]},"IS 579":{"CourseName":"Virtual Software Teams Management","Prereq":"PREREQUISITE(S): PM 430 or IS 430","Description":"Application of project management principles, tools, and techniques to a virtual software development project","Years":[null]},"IS 580":{"CourseName":"Technology Entrepreneurship","Prereq":"PREREQUISITE(S): Completion of the foundation phase.","Description":"In-depth examination of the entrepreneurial process within technology intensive ventures. Roles of entrepreneurs and their start-up teams. Suitable business models and strategies. Legal issues and intellectual property. Financial issues and venture resources. Role of the customer and entrepreneurial marketing. Students will analyze and present case studies of technology entrepreneurial ventures. Students will develop a marketing plan and a business plan for a technology-intensive entrepreneurial venture of their choice.","Years":["Winter 2017-2018"]}},
			{"CSC 436":{"CourseName":"Web Applications","Prereq":"PREREQUISITE(S): CSC 435 and CSC 447","Description":"This course covers the design and development of modern web applications and their interaction with web services. The primary focus is on client-side web applications using AJAX-techniques to access web services. Possible topics include: HTML5","Years":[null]},"CSC 438":{"CourseName":"Framework for Web Application Development","Prereq":"PREREQUISITE: CSC 407","Description":"This course introduces concepts, techniques, technologies and APIs for web application development. The main focus of the course is on the Model-View-Controller design pattern employed by modern full-stack web frameworks. Concepts and techniques covered include client/server programming, database abstraction APIs, and asynchronous javascript. Examples of full-stack MVC frameworks include Ruby-on-Rails (written in Ruby), Django and TurboGears (written in Python).","Years":["Fall 2018-2019","Spring 2015-2016","Fall 2015-2016","Fall 2014-2015","Fall 2013-2014"]},"CSC 439":{"CourseName":"Computer Security","Prereq":"Prerequisite(s): CSC 407","Description":"This course covers core principles of computer security. Topics include : user authentication","Years":[null]},"CSC 443":{"CourseName":"Introduction to Operating Systems","Prereq":"PREREQUISITE: CSC 403 and CSC 407","Description":"An advanced course on operating system design and implementation. Process management and scheduling, memory management, file systems, device drivers, access control, and virtualization will be covered. The emphasis of the course will be on implementing components of a functional operating system.","Years":["Fall 2018-2019","Winter 2013-2014"]},"CSC 448":{"CourseName":"Compiler Design","Prereq":"PREREQUISITE(S): CSC 447","Description":"Design and structure of high level languages. Lexical scan, top down and bottom up syntactic analysis. Syntax directed translation and LR(k) grammars.","Years":["Fall 2018-2019","Spring 2014-2015","Spring 2013-2014"]},"CSC 461":{"CourseName":"Optimized C++","Prereq":"PREREQUISITE(S): CSC 400 and CSC 403 and CSC 406","Description":"Analysis and implementation techniques to improve the performance and resource usage of C++ programs. This class will provide low level understanding of C++'s internal behavior that can be exploited to create faster performing software. Analysis of existing software to help identify and remedy execution performance issues related to data layout, processor caching, unintended compiler interactions, algorithmic considerations, data containers and supplied subsystems. Topics include: performance enhancements through SIMD instruction set, dynamic memory usage, caching, implicit behavior, C++ language extensions, algorithms, streaming and profiling.","Years":["Fall 2018-2019","Fall 2017-2018","Spring 2016-2017","Fall 2016-2017","Fall 2015-2016","Fall 2014-2015"]},"CSC 462":{"CourseName":"Optimized C++ Multithreading","Prereq":"PREREQUISITE(S): GAM 491 or CSC 461","Description":"Software architecture of applied C++ concurrency and multithreading fundamentals. Basic threading concepts: process model, threads, stacks, fibers, mutexes, semaphores, atomics and events. Leveraging advanced C++ language features relating to the memory model and the threading support in large multithreaded architectures. Architecting lock-based and lock-free concurrent data structures in applications. Designing a threaded management system to control the access and reuse of threads in applications. Designing multithreaded architecture for real-time performance.","Years":["Fall 2018-2019","Spring 2014-2015"]},"CSC 471":{"CourseName":"Mobile Application Development for iOS","Prereq":"PREREQUISITE(S): CSC 403 and CSC 407","Description":"This course introduces the core issues associated with application development for mobile devices using the iOS platform. Students will learn the Swift language, the XCode IDE, UIKit and other frameworks, the elements and architecture of the user interfaces, and more. Students will be exposed to the iOS system architecture including memory management, MVC, delegates and threads. Topics will also include understanding and handling of multi-touch events, gestures, and motion events.","Years":["Winter 2017-2018","Winter 2016-2017","Winter 2015-2016","Spring 2014-2015","Spring 2013-2014","CLOSED Fall 2013-2014","Spring 2012-2013"]},"CSC 472":{"CourseName":"Mobile Application Development for Android","Prereq":"PREREQUISITE(S): CSC 403 and CSC 407","Description":"This course introduces the core issues associated with application development for mobile devices using the Android platform. Students will learn the Eclipse IDE, frameworks, the elements and architecture of user interfaces, graphics, and more. Students will be exposed to the Android system architecture, including Views, Widgets, Resources, Adapters, Intents and Activities. Topics will also include understanding and handling of threads, multi-touch events, gestures, and motion events.","Years":["Fall 2018-2019","Fall 2016-2017","Fall 2015-2016","Fall 2014-2015"]},"CSC 475":{"CourseName":"Introduction to Robotics","Prereq":"PREREQUISITES: CSC 407","Description":"An introduction to the field of Robotics. Topics include history of robotics, kinematics, control theory, and sensor theory. A large portion of class time will be lab based, building and programming robots using the Lego Mindstorms NXT Robotics Kit. The programming will be using a C derivative and knowledge of C and general systems concepts is required.","Years":["Fall 2018-2019"]},"CSC 534":{"CourseName":"Software Development for Limited and Embedded Devices","Prereq":"PREREQUISITE(S): SE 450","Description":"This course will focus on the unique aspects, tools, and techniques of developing software applications for limited and embedded devices, such as set-top boxes and smart cards. Formerly CSC 542.","Years":[]},"CSC 536":{"CourseName":"Distributed Systems II","Prereq":"PREREQUISITE(S): CSC 435","Description":"An intermediate course on distributed systems. Topics may include: clock synchronization","Years":[null]},"CSC 540":{"CourseName":"Mobile Application Development II","Prereq":"PREREQUISITE(S): CSC 471","Description":"This course will cover advanced topics in mobile and wireless application development. The topics covered will be made explicit by the course instructor when the course is offered.","Years":[]},"CSC 548":{"CourseName":"Advanced Compiler Design","Prereq":"PREREQUISITE(S): CSC 448.","Description":"Emphasis on practical problems in implementing compilers, data flow analysis, code optimization, error analysis. Discussion of compiler generators. As a class project, students will write a compiler.","Years":[]},"CSC 549":{"CourseName":"Database System Implementation","Prereq":"PREREQUISITE(S): CSC 453","Description":"This is an advanced database course that covers issues in DBMS implementation. Topics covered in this course include: physical data organizations, indexing and hashing, query processing and optimization, database recovery techniques, transaction management, concurrency control, and security.","Years":["Fall 2013-2014"]},"CSC 551":{"CourseName":"Distributed Database Systems","Prereq":"PREREQUISITE(S): CSC 453 and (CSC 435 or TDC 405 or TDC 463)","Description":"Distributed database architecture, distributed database design, distributed query processing, query decomposition and optimization of distributed queries, distributed transaction management and concurrency control, distributed DBMS reliability, distributed database operating systems. Distributed multidatabase systems. Client/Server database systems.","Years":[]},"CSC 552":{"CourseName":"Concurrent Software Development","Prereq":"PREREQUISITE(S): SE 450 and CSC 407","Description":"Fundamentals and techniques of developing concurrent object-oriented applications, using a patterns-based approach. Concepts covered include: threads, synchronization and object locking, thread blocking and deadlock, safety and liveness, state-dependent action and concurrency control. Formerly SE 552.","Years":["Fall 2018-2019","Fall 2016-2017","Fall 2015-2016","Fall 2014-2015","Fall 2013-2014"]},"CSC 553":{"CourseName":"Advanced Database Concepts","Prereq":"PREREQUISITE(S): CSC 453.","Description":"An introduction to advanced selected topics in databases. The topics include: intelligent and deductive databases, temporal databases, multimedia databases, spatial and geographic databases, fuzzy databases, mobile databases, data mining and data warehousing, as well as emerging issues and concepts in database design, implementation and management.","Years":["Winter 2017-2018","Winter 2016-2017","Winter 2015-2016","Spring 2014-2015","Winter 2013-2014"]},"CSC 595":{"CourseName":"Topics in Computer Science","Prereq":"PREREQUISITE(S): For specific prerequisites, see syllabus or consult course instructor. (variable credit)","Description":"Specific topics will be selected by the instructor and may vary with each quarter. Can be repeated for credit. Variable credit.","Years":["Fall 2018-2019",null,null]},"CNS 450":{"CourseName":"Digital Forensic Techniques","Prereq":"PREREQUISITE(S): CSC 407 or CNS 418","Description":"This course focuses on the forensic acquisition, analysis and presentation of data from computer systems. This course covers: preservation and interpretation of evidence","Years":[null]},"HCI 441":{"CourseName":"Introduction to User-Centered Development","Prereq":"PREREQUISITE(S): CSC 403","Description":"Overview of the user-centered design (UCD) process with an additional emphasis on user interface development. Coverage of UCD process includes effective, low-cost methods for user research, interaction design and evaluation. User interface development involves application of front-end development languages (HTML and JavaScript) and frameworks (jQery). This course is offered to students with programming experience as an alternative to IT 411 and HCI 440. Students may not receive credit for this course and HCI 440.","Years":[]},"TDC 478":{"CourseName":"Information Storage and Management","Prereq":"PREREQUISITE(S): none","Description":"This course provides a comprehensive overview of network-based storage technology and information storage infrastructure. Major topics include the storage architectures, service features, and benefits of Intelligent Storage Systems. Networked storage technologies include fiber channel (FC), based Storage Area Network (SAN), Network Attached Storage (NAS), and IP-SAN. Advanced storage technologies on Content Addressed Storage (CAS), information security, and storage virtualization are also discussed.","Years":["Fall 2018-2019","Fall 2016-2017","Fall 2015-2016","Fall 2014-2015","Fall 2013-2014"]},"TDC 484":{"CourseName":"Scripting for Network Management","Prereq":"PREREQUISITE(S): TDC 413","Description":"This is a hands-on course on using script languages to develop practical applications for Network Management. Students will first learn the fundamentals of Linux system and script language(s) for task automation, and use scripts to develop dynamic web sites. After that, the course will cover Simple Network Management Protocol (SNMP), and use Application Programming Interface (API) to automate networks tasks of Fault Management, Configuration Management, Accounting Management, Performance Management, and Security Management (FCAPS). The final project of the course is to develop a dynamic web site with the above five functional areas to manage Linux servers, Ethernet switches and IP routers.","Years":["Winter 2017-2018","Winter 2016-2017","Winter 2015-2016","Winter 2014-2015","Spring 2013-2014"]},"TDC 568":{"CourseName":"Network Management","Prereq":"PREREQUISITE(S): TDC 463","Description":"The five major areas of network management--fault management, performance management, security, accounting and configuration management-are discussed. Advanced topics such as fault diagnosis and isolation, event correlation, MIB design, SNMP programming, performance monitoring, service level agreements and network security architectures are also discussed.","Years":["Spring 2017-2018","Spring 2016-2017","Spring 2015-2016","Winter 2014-2015"]},"GAM 690":{"CourseName":"Game Development Studio I","Prereq":"PREREQUISITE(S): GAM 475","Description":"In this course and its continuation GAM 691, students will work in small teams to design and implement a computer game. The courses must be taken consecutively.","Years":[null,null,null]},"GAM 691":{"CourseName":"Game Development Studio II","Prereq":"PREREQUISITE: GAM 474 or SE 456 (variable credit)","Description":"Continuation of GAM 690.","Years":[null,null,null]},"SE 441":{"CourseName":"Continous Delivery and Devops","Prereq":"PREREQUISITE(S): CSC 403","Description":"A study of the tools, techniques, and processes used in continuous delivery and DevOps. Students will learn to transform an organization that uses traditional software release methods into one that embraces continuous delivery and deployment. Topics will include: the economics of DevOps and continuous delivery","Years":[null]},"SE 452":{"CourseName":"Object-Oriented Enterprise Computing","Prereq":"PREREQUISITE(S): CSC 403","Description":"techniques in the design, development, and integration of server-side enterprise applications using technologies such as servlets, Java Server Pages, and JDBC. Topics include web applications, multi-tier architecture, model-view-controller architecture, database connectivity, and security.","Years":[null,null,null,null]},"SE 459":{"CourseName":"Agile Software Development","Prereq":"PREREQUISITE(S): SE 450","Description":"This course focuses on the fundamentals, principles, tools, and techniques in agile software development. Students will gain hands-on experiences in agile software development through projects dealing with various aspects of agile development, including planning, construction, testing, and integration. Students will be able to effectively participate in and manage agile software development as a result of their successfully completing this course.","Years":[null,null,null,null]},"SE 525":{"CourseName":"Software Security Architecture","Prereq":"PREREQUISITE(S): CSC 435 and SE 450","Description":"Students in this course will learn architectural patterns for integrating security into software such as web applications. Topics include: an overview of software security","Years":[null]},"SE 526":{"CourseName":"Software Security Assesment","Prereq":"Prerequisite(s): CSC 435","Description":"Students in this course will learn how to conduct software security assessment to identify software vulnerabilities in software such as web applications and operating system services. Topics include: common software vulnerabilities and attack vectors","Years":[null]},"SE 554":{"CourseName":"Enterprise Component Architecture","Prereq":"PREREQUISITE(S): SE 450 or SE 452.","Description":"This course will focus on object-oriented component architectures for enterprise applications. Topics include: Enterprise Java Beans (EJB), Java Naming and Directory Interfaces (JNDI), Java Mail and Messaging Services.","Years":[null,null,null,null,null,null,null,null,null]},"SE 560":{"CourseName":"Structured Document Interchange and Processing","Prereq":"PREREQUISITE(S): SE 450 OR (CSC 301 and SE 430)","Description":"Document and data interchange among different applications is an extremely important aspect of software application development. This course will focus on emerging technologies associated with the Extensible Markup Language (XML), such as the Document Object Model (DOM), the Simple API for XML (SAX), the XML Stylesheet Language (XSL) and Transformation Language (XSLT), and XML Schema. Applications of these technologies will be discussed in conjunction with tools and techniques for parsing, transforming, and manipulating documents.","Years":[null,null,null,null,null,null,null,null,null]},"SE 491":{"CourseName":"Software Engineering Studio (Capstone)","Prereq":"PREREQUISITE(S): SE 450 or SE 456.","Description":"Students will work in small teams to develop realistic software systems in a master-apprentice environment. The instructor will serve as a master/mentor/project leader. Students will apply knowledge and skills they have learned in previous course in solving real world problems.","Years":[null,null,null,null]},"SE 591":{"CourseName":"Software Engineering Studio II","Prereq":"PREREQUISITE(S): SE 491","Description":"This is the continuation of SE 491. SE 491 and 591 must be taken as a sequence in two consecutive quarters.","Years":[null,null,null,null,null,null,null,null,null]}},
			{"SE 430":{"CourseName":"Object Oriented Modeling","Prereq":"PREREQUISITE(S): CSC 403","Description":"Object-oriented modeling techniques for analysis and design. Provides the tools and techniques needed to solve complex, real-world software engineering problems in an object-oriented manner, using the most effective elements of the Unified Process. The course covers the essential concepts and notation of the Unified Modeling Language (UML), the standard notation for object-oriented analysis and design. Team project.","Years":[null,null,null,null,null,null,null,null,null]},"SE 433":{"CourseName":"Software Testing and Quality Assurance","Prereq":"PREREQUISITE(S): CSC 403","Description":"This course is designed for the software engineering professional to gain a greater understanding of the key ingredients in creating and/or managing a successful testing program to meet project needs. Topics covered include test lifecycle planning, test design & coverage analysis, complexity, levels of testing such as unit, integration, system, performance and stress testing. Best practice strategies in software testing such as verification & validation, early lifecycle testing, risk based testing and automation will also be examined including exposure to test automation methods and tools.","Years":[null,null,null,null,null,null,null,null,null]},"SE 441":{"CourseName":"Continous Delivery and Devops","Prereq":"PREREQUISITE(S): CSC 403","Description":"A study of the tools, techniques, and processes used in continuous delivery and DevOps. Students will learn to transform an organization that uses traditional software release methods into one that embraces continuous delivery and deployment. Topics will include: the economics of DevOps and continuous delivery","Years":[null]},"SE 452":{"CourseName":"Object-Oriented Enterprise Computing","Prereq":"PREREQUISITE(S): CSC 403","Description":"techniques in the design, development, and integration of server-side enterprise applications using technologies such as servlets, Java Server Pages, and JDBC. Topics include web applications, multi-tier architecture, model-view-controller architecture, database connectivity, and security.","Years":[null,null,null,null]},"SE 453":{"CourseName":"Architecture and Frameworks for Developing Client Applications","Prereq":"Prerequisite: SE 452","Description":"This course will focus on software architectures, frameworks, and techniques for developing web-based thin client applications as well as rich desktop client applications. Topics will include discussion on design and architectural patterns, such as model-view-controller pattern survey of widely used development frameworks for building client applications, such as Struts, Java Server Face (JSF), Swing, and SWT, etc. discussion of widely used techniques such as AJAX","Years":[null]},"SE 456":{"CourseName":"Architecture of Real-Time Systems","Prereq":"PREREQUISITE(S): CSC 403","Description":"This course discusses the principles, styles, and patterns of real-time software architecture. Trade-offs and ramifications of software architecture with respect to performance, maintainability, and reusability, will be explored. The course will also investigate the design and implementation of real-time behavior and constraints for Common Design Patterns such as Observer, Visitor, and Strategy. Finally, the course will demonstrate how creation of real-time Data Driven environment allows the run-time object data to control the behavior and flow of an application. These topics will be discussed in the context of best practices in software engineering such as iterative development, testing, and continuous integration.","Years":[null,null,null,null,null,null,null,null,null]},"SE 457":{"CourseName":"Service-Oriented Architecture","Prereq":"Prerequisite: SE 450 or CSC 435","Description":"An in-depth study of service oriented architecture (SOA) from the business, architectural, and technology perspectives. The business perspective will explain the imperatives behind SOA and discuss the significance of SOA in industry. The architectural perspective will discuss the different architectural models of software development and contrast these with SOA. The technology perspective will provide students with the opportunity to gain the required hands-on experience to analyze, design, implement and deploy SOA solutions that will meet both functional and non-functional requirements. Major topics include software architectures in practice, SOA development lifecycle, Enterprise Service Bus, SOA analysis and design methods, Web Services, and governance.","Years":[null,null,null,null,null,null,null,null,null]},"SE 459":{"CourseName":"Agile Software Development","Prereq":"PREREQUISITE(S): SE 450","Description":"This course focuses on the fundamentals, principles, tools, and techniques in agile software development. Students will gain hands-on experiences in agile software development through projects dealing with various aspects of agile development, including planning, construction, testing, and integration. Students will be able to effectively participate in and manage agile software development as a result of their successfully completing this course.","Years":[null,null,null,null]},"SE 475":{"CourseName":"Managing Globally Distributed Software Development","Prereq":"PREREQUISITE(S): CSC 403","Description":"Managing Globally Distributed Software Development (GDSD) for IT projects. Issues associated with time zone differences, infrastructure support, geographical dispersion, and lack of centralized communication. The course will focus on the management, implementation and deployment of software within the context of outsourced, distributed development, and insourced projects. Additional topics include strategic management issues such as justification, vetting, consulting services and partnerships. Course will include several hands-on distributed development projects.","Years":[null,null,null,null,null,null,null,null,null]},"SE 477":{"CourseName":"Software and Systems Project Management","Prereq":"PREREQUISITE(S): Knowledge of the Software development life cycle model, for example through courses such as SE430, ECT455, IS425, MIS555 or through appropriate work experience.","Description":"Project Management is presented from a practitioner's view. The four basic building blocks of software project management: people, process, tools, and measurements are covered. Special emphasis is placed on professional standards such as the Project Management Book of Knowledge and IEEE Software Engineering Standards. Specific topics include Managing People, Selecting Project Tools, Leadership & Motivation, Software Development Processes, Estimation, Risk Analysis, Scheduling and Tracking, Leveraging Measurements, and Project Completion. Consideration is given to rapid development and project cultural issues.","Years":[null,null,null,null,null,null,null,null,null]},"SE 480":{"CourseName":"Software Architecture I","Prereq":"PREREQUISITE(S): SE 450","Description":"The Software Architecture process is concerned with describing, evaluating, and designing systems at the architectural level. This course will discuss the role of architecture and the architect in the software development cycle. It will introduce architectural patterns and tactics, architecture assessment techniques, architecture driven design, and techniques for documenting architectures. The course will involve design, development, and assessment activities.","Years":[null,null,null,null,null,null,null,null,null]},"SE 482":{"CourseName":"Requirements Engineering","Prereq":"Prerequisite(S): SE430 or SE450.","Description":"Requirements Engineering (RE) plays a critical role in the software development process. This course will introduce related vocabulary, concepts, and techniques, and will examine the role of RE in software and systems engineering. The course will cover topics related to eliciting, validating, negotiating, analyzing, specifying, and managing requirements. Popular RE tools will also be introduced.","Years":[null,null,null,null,null,null,null,null,null]},"SE 491":{"CourseName":"Software Engineering Studio (Capstone)","Prereq":"PREREQUISITE(S): SE 450 or SE 456.","Description":"Students will work in small teams to develop realistic software systems in a master-apprentice environment. The instructor will serve as a master/mentor/project leader. Students will apply knowledge and skills they have learned in previous course in solving real world problems.","Years":[null,null,null,null]},"SE 529":{"CourseName":"Software Risk Management","Prereq":"PREREQUISITE(S): IT 403 and SE 430 or consent.","Description":"Identification, estimation, evaluation, planning, controlling, and monitoring of risk involved in the development, maintenance, operation and evolution of systems.","Years":[null,null,null,null,null,null,null,null,null]},"SE 525":{"CourseName":"Software Security Architecture","Prereq":"PREREQUISITE(S): CSC 435 and SE 450","Description":"Students in this course will learn architectural patterns for integrating security into software such as web applications. Topics include: an overview of software security","Years":[null]},"SE 526":{"CourseName":"Software Security Assesment","Prereq":"PREREQUISITE(S): CSC 435","Description":"Students in this course will learn how to conduct software security assessment to identify software vulnerabilities in software such as web applications and operating system services. Topics include: common software vulnerabilities and attack vectors","Years":[null]},"SE 533":{"CourseName":"Software Validation and Verification","Prereq":"PREREQUISITE(S): SE 450.","Description":"Techniques, methods and tools for software inspection and testing. Theory and applications of formal verification of programs. Techniques and tools for automated analysis of programs.","Years":[null,null,null,null,null,null,null,null,null]},"SE 554":{"CourseName":"Enterprise Component Architecture","Prereq":"PREREQUISITE(S): SE 450 or SE 452.","Description":"This course will focus on object-oriented component architectures for enterprise applications. Topics include: Enterprise Java Beans (EJB), Java Naming and Directory Interfaces (JNDI), Java Mail and Messaging Services.","Years":[null,null,null,null,null,null,null,null,null]},"SE 556":{"CourseName":"Advanced Architecture of Computer Games","Prereq":"PREREQUISITE(S): SE 456 and CSC 407","Description":"This course discusses the advanced issues in software architecture and the engineering of computer games. The topics include engineering and programming issues in graphics, scene management, kinematics, simulation, collision detection. Software design patterns and frameworks for computer games. Project management, configuration management, and quality assurance of computer game development projects.","Years":[null,null,null,null,null,null,null,null,null]},"SE 560":{"CourseName":"Structured Document Interchange and Processing","Prereq":"PREREQUISITE(S): SE 450 OR (CSC 301 and SE 430)","Description":"Document and data interchange among different applications is an extremely important aspect of software application development. This course will focus on emerging technologies associated with the Extensible Markup Language (XML), such as the Document Object Model (DOM), the Simple API for XML (SAX), the XML Stylesheet Language (XSL) and Transformation Language (XSLT), and XML Schema. Applications of these technologies will be discussed in conjunction with tools and techniques for parsing, transforming, and manipulating documents.","Years":[null,null,null,null,null,null,null,null,null]},"SE 579":{"CourseName":"Analytics and Data Mining in Software Engineering","Prereq":"PREREQUISITE(S): SE 450","Description":"This courses discusses the application of selected statistical analysis, data mining, and machine learning techniques to the area of Software Engineering. These techniques are used for purposes as varied as stakeholder analysis, mining software repositories, trace retrieval, bug prediction, recommender systems in Software Engineering domains, and software process improvement techniques. The course demonstrates how these techniques can be used to enhance project management and other software engineering activities in software intensive systems and provides students with hands-on experience using them on real project data. (No prior knowledge of data mining and knowledge management is assumed.)","Years":[null,null,null,null,null,null,null,null,null]},"SE 581":{"CourseName":"Software Architecture II","Prereq":"PREREQUISITE(S): SE 480","Description":"In this second Software Architecture course, students will be exposed to case studies of real-world software architectures for which reliability, performance, availability, scalability and other such concerns drive the architectural design. Students will gain hands-on practice in reverse engineering, designing, and assessing existing systems including performance testing. Student will build on their prior knowledge to design complex systems in principled and systematic ways. The course will involve designing and implementing a simulated high scalability, high reliability system.","Years":[null,null,null,null,null,null,null,null,null]},"SE 582":{"CourseName":"Software-Intensive Systems Engineering and Management","Prereq":"PREREQUISITE(S): (SE 477 or PM 430 or IS 430) and (SE 430 or SE 482 or IS 485)","Description":"This course will introduce students to fundamental principles of systems engineering for large and complex software intensive systems. The course will include a study of systems engineering failures, and will cover topics related to problem frames","Years":[null]},"SE 591":{"CourseName":"Software Engineering Studio II","Prereq":"PREREQUISITE(S): SE 491","Description":"This is the continuation of SE 491. SE 491 and 591 must be taken as a sequence in two consecutive quarters.","Years":[null,null,null,null,null,null,null,null,null]}},
			{"CSC 451":{"CourseName":"Database Design for Information Systems","Prereq":"PREREQUISITE(S): None","Description":"Requirement analysis, conceptual design, logical design and implementation of relational databases. Emphasis will be on E-R modeling and E-R mapping, along with basic normalization and SQL for database implementation.","Years":["Fall 2018-2019","Spring 2017-2018","Winter 2017-2018","Fall 2017-2018","Summer I 2016-2017","Spring 2016-2017","Winter 2016-2017","Fall 2016-2017","Summer I 2015-2016","Spring 2015-2016","Winter 2015-2016","Fall 2015-2016","Summer I 2014-2015","Spring 2014-2015","Winter 2014-2015","Fall 2014-2015","Summer I 2013-2014","Spring 2013-2014","Winter 2013-2014","Fall 2013-2014","Summer I 2012-2013","Spring 2012-2013"]},"IS 421":{"CourseName":"Systems Analysis","Prereq":"PREREQUISITE(S): None","Description":"Course focus is on both traditional and object oriented systems analysis, with an emphasis upon developing competency in a wide range of modeling techniques. Specific topics include: overview of the software development environment and project management","Years":[null]},"IS 422":{"CourseName":"System Design, Implementation, and Maintenance","Prereq":"PREREQUISITE(S): IS 421 and CSC 451","Description":"Course focus is on both traditional and object oriented systems design. Specific topics include: database design, including logical and physical design","Years":[null]},"IS 430":{"CourseName":"Fundamentals of IT Project Management","Prereq":"PREREQUISITE(S): None","Description":"This course concentrates on monitoring, managing and controlling assets and resources on a single IT project. Topics covered are project methodologies","Years":[null]}},
			{"CSC 431":{"CourseName":"Scientific Computing","Prereq":"PREREQUISITE(S): (CSC 401 and two quarters of calculus) or instructor permission","Description":"This course presents fundamental numerical algorithms for solving problems in scientific computing and computational finance. Areas covered include: error analysis, computer arithmetic, linear algebra, optimization problems, numerical integration (solvers), ordinary differential equations (ODE). The emphasis of the course is on the design of the algorithms, and their analysis. Algorithms will be implemented using mathematical software.","Years":["Winter 2017-2018","Winter 2016-2017","Winter 2015-2016","Winter 2014-2015","Winter 2013-2014"]},"CSC 440":{"CourseName":"Cryptology","Prereq":"PREREQUISITE(S): CSC 403","Description":"Introduction to the methods of cryptography and cryptanalysis. Topics include classical cryptography (codes, monoalphabetic and polyalphabetic substitution ciphers, transposition ciphers), modern block ciphers (such as DES, AES), and public key cryptography (such as RSA). Optional topics include zero-knowledge protocols, information theory, coding theory, error-correcting codes, steganography, stream ciphers, hashing algorithms, quantum cryptography, elliptic curve cryptography, and history.","Years":["Winter 2017-2018","Winter 2016-2017","Winter 2015-2016","Winter 2014-2015"]},"CSC 444":{"CourseName":"Automata Theory and Formal Grammars","Prereq":"PREREQUISITE(S): CSC 400 and CSC 403","Description":"An introduction to the most important abstract models of computation and their applications: finite state machines and pushdown automata. Explores the relationship between regular expressions and formal expressions and automata.","Years":["Fall 2013-2014"]},"CSC 489":{"CourseName":"Theory of Computation","Prereq":"PREREQUISITE(S): CSC 444 or CSC 421.","Description":"Advanced topics in the mathematical foundations of computation. Topics may include random access and Turing machines, recursive functions, algorithms, computability and computational complexity, intractable problems, NP-complete problems.","Years":["Fall 2016-2017","Winter 2013-2014"]},"CSC 503":{"CourseName":"Parallel Algorithms","Prereq":"PREREQUISITE(S): CSC 421","Description":"Development, implementation, and applications of parallel algorithms. Models of parallel computation. Parallel sorting, searching and graph algorithms, as well as other parallel algorithms, will be studied and implemented on both simulated and actual parallel machines.","Years":["Winter 2015-2016","Winter 2014-2015"]},"CSC 521":{"CourseName":"Monte Carlo Algorithms","Prereq":"PREREQUISITE(S): (CSC 402 or CSC 404) and CSC 423 or consent of instructor","Description":"A course about the use of random numbers for numerical computation with particular emphasis on implementation issues and applications in science and finance. Covered topics include: pseudo random number generators, the inversion method, the accept-reject method, discrete event simulations, multi-dimensional integration, the Metropolis and the Bootstrap algorithms.","Years":["Spring 2017-2018","Spring 2016-2017","Spring 2015-2016","Spring 2014-2015","Spring 2013-2014","Spring 2012-2013"]},"CSC 525":{"CourseName":"Combinatorial Optimization","Prereq":"PREREQUISITE(S): CSC 421.","Description":"This course defines and introduces the concepts and techniques needed to formulate and model optimization problems. A set of fundamental problems in combinatorial optimization will be covered together with their applications. The emphasis will be on the design and analysis of algorithms for such problems. The computational complexity of this set of problems (easy/hard to solve/approximate) will be discussed, and techniques for coping with intractable problems will be introduced.","Years":["Winter 2016-2017"]},"CSC 531":{"CourseName":"Introduction to Bioinformatics","Prereq":"Prerequisites: CSC 421 and SE 450","Description":"An introduction to the field of Bioinformatics, which is computational modeling of biological and biochemical processes. Some programming in Java will be involved. Little biological knowledge will be assumed: any required will be taught in the course. Topics will include genomics, biological databases, sequence alignment (longest common subsequence), phylogenetic trees, and protein folding.","Years":["Spring 2013-2014"]},"CSC 535":{"CourseName":"Formal Semantics of Programming Languages","Prereq":"PREREQUISITE(S): CSC 447.","Description":"Methods of formal semantics. Lambda-calculus. Lattices and domains. Reflexive domains. Formal semantics of the lambda-calculus. Languages with state. Interpretation functions. Expressions and environments. Command and stores. Control structures and continuations.","Years":[]},"CSC 547":{"CourseName":"Advanced Topics in Program Languages","Prereq":"PREREQUISITE(S): Instructor consent required.","Description":"A project-based course on advanced topics related to programming languages and programming environments. The course does not have any formal exams or homework assignments, but participants are expected to read papers on current research, actively participate in discussions, and complete a significant course project.","Years":[]},"CSC 557":{"CourseName":"Foundations of Computer Security","Prereq":"PREREQUISITE(S): CSC 439","Description":"This course provides an overview of foundational techniques in the specification and verification of computer systems in the presence of malicious attackers. Topics may include: formal models of interaction, attacker models, robust safety properties such as confidentiality and authenticity, information flow properties such as noninterference, and tools such as model checkers, type checkers and theorem provers. Formerly 557.","Years":[]},"CSC 580":{"CourseName":"Design of Object-Oriented Languages","Prereq":"PREREQUISITE(S): SE 450","Description":"This course covers issues in the design and specification of object-oriented programming languages. Sample topics include the use of patterns in program representation, static and dynamic semantics, subject reduction, sub-typing, inheritance, polymorphism, genericity and concurrency. Formerly SE 580.","Years":[]},"CSC 591":{"CourseName":"Topics in Algorithms","Prereq":"PREREQUISITE(S): For specific prerequisites, see syllabus or consult course instructor. (variable credit)","Description":"Specific topics will be selected by the instructor and may vary with each quarter. Can be repeated for credit. Variable credit.","Years":[]},"SE 533":{"CourseName":"Software Validation and Verification","Prereq":"PREREQUISITE(S):SE 450","Description":"Techniques, methods and tools for software inspection and testing. Theory and applications of formal verification of programs. Techniques and tools for automated analysis of programs.","Years":[]}
		}
	]
}